[  {
    "id": "6f3147fa-119f-11e8-858a-f6bea5c8462d",
    "created_at": "Wed Feb 14 15:57:41 UTC 2018",
    "title": "Hybris Developer",
    "location": "Eindhoven",
    "type": "Full Time",
    "description": "<p><b>With its solidly-grounded commerce skills and technical knowledge, Elision is a trusted advisor for building high-end commerce trade channels.&lt;.b&gt;</b></p>\n\n<p>Elision delivers solutions that guarantee a consistent interaction over all channels and touchpoints. We create value by means of a comprehensive package of services, from digital strategy consulting and service design to development and managed services. This makes Elision the partner for companies accompanying them in their digital transformation.</p>\n\n<p>Elision is an innovative player and offers the best possible solution within the SAP Customer Engagement and Commerce landscape: hybris commerce, hybris marketing and C4C.</p>\n\n<p>Elision is part of the Xplore group (Cronos).</p>\n\n<p>As our growth continues, we are looking for experienced Hybris developers to join our teams for projects in the Netherlands!</p>\n\n<p><b>YOUR POSITION</b><br>\nWorking in a team on the development of high-end e-commerce applications for global brands, B2B contexts and general Omni-channel digitalisation projects. You are a technical expert in SAP Hybris and closely follow developments in the field of Java development, focussing on back-end or front-end (or both).</p>\n\n<p><b>WHO ARE YOU?</b><br>\nYou have 5 years off relevant consulting or industry experience and at least 3+ years' experience in implementing the Hybris platform (5.x and 6.x). A Strong background in Java/Spring environments and hands-on development experience, as well as a good knowledge of object-oriented principles, design patterns, database design and data modelling is required. You're familiar with front-end ( HTML, CSS, Bootstrap, Angular, React , ... ) and back-end Java-based frameworks.</p>\n\n<p><i>\"Great things in business are never done by one person, they are done by a team of people.\" Steve Jobs</i></p>\n\n<ul>\n<li>You are a real team player</li>\n<li>You have experience in agile development</li>\n<li>In all of this you are customer oriented and you strive to get the job done</li>\n<li>Communication is essential as you are working together with clients and a team of developers, architects, analysts, project managers and other</li>\n<li>You preferably obtained a bachelor or a master's degree</li>\n<li>Besides Dutch you also possess a good knowledge of English</li>\n</ul><p><b>WE OFFER YOU</b></p>\n\n<ul>\n<li>A permanent position in a young team, with room for creativity, initiative and growth</li>\n<li>A pleasant working environment in a traffic jam-free location</li>\n<li>An opportunity for growth and learn from the experts in the business</li>\n<li>Trainings and events on a regular base</li>\n</ul><p>INTERESTED?\nPlease apply using the application form.</p>\n\n<p><a href=\"https://elision.redirect.your-jobresponse.com/hybris_developer_eindhoven/187213/V819/apply\">Click here for the application form!</a></p>\n\n<p><i> Keywords: Vacancy, full-time, Eindhoven, development, front-end, Hybris.</i></p>",
    "how_to_apply": "<p><a href=\"https://elision.redirect.your-jobresponse.com/hybris_developer_eindhoven/187213/V819/apply\">Click here for the application form!</a></p>",
    "company": "Elision",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/5514e0b6-119f-11e8-8821-9d5cdaeca1b1.png",
    "url": "http://jobs.github.com/positions/6f3147fa-119f-11e8-858a-f6bea5c8462d"
  },
  {
    "id": "df5c2d7e-10d2-11e8-8905-81f954c87efa",
    "created_at": "Tue Feb 13 15:32:12 UTC 2018",
    "title": "Senior Frontend Developer with Angular JS 2 (Homeoffice / Flexible)",
    "location": "Remote",
    "type": "Full Time",
    "description": "<p><strong>This is a full-time remote position, we accept applications from anywhere in the world.</strong></p>\n\n<p><strong>&gt;&gt; Check out <a href=\"https://jobs.digistore24.com/senior-front-end-developer/lp/\">our job video</a> and <a href=\"https://jobs.digistore24.com/en/jobs/\">our careers page</a> to see if we would be a good fit.&lt;&lt;</strong></p>\n\n<p><em>At Digistore24 we develop software that has an impact on thousands of small and medium sized businesses every day. If you are man of action who loves to work in a small, family-like team and who has the passion and work ethic to develop great software products, we are the right fit for you.</em></p>\n\n<p>We are one of the fastest growing software companies in Europe. Our core platform is an automation solution developed by a small and extremely competent team. It provides a complete infrastructure to over 100.000 entrepreneurs to build a scalable online business with millions of customers.</p>\n\n<p><strong>The Job</strong></p>\n\n<p>We are looking for an experienced front-end developer with high motivation, a keen interest in our business use case and a sense for good user experience and beautiful design. You should be very familiar with AngularJS 2 and have an uncompromising drive to design beautiful interfaces.</p>\n\n<p>It is also important to us that you have already created a complex web application, that you have experience in agile development processes, and that you consider first-class, clean, and easily testable code as the basis of your work. You should also bring with you:</p>\n\n<ul>\n<li>Proficient understanding of web markup, including HTML5, CSS3</li>\n<li>Good understanding of advanced JavaScript libraries and frameworks, such as AngularJS 2</li>\n<li>Min. 5 years of professional experience along with a proven track record of delivering complex web projects in a leading role</li>\n<li>Basic understanding of server-side CSS pre-processing platforms, such as LESS and SASS</li>\n<li>Ability to improve architecture and code quality by refactoring</li>\n<li>Basic knowledge of image authoring tools, to be able to crop, resize, or perform small adjustments on an image. (Familiarity with tools such as as Gimp or Photoshop is a plus)</li>\n<li>Proficient understanding of cross-browser compatibility issues and ways to work around them</li>\n<li>Experience with agile development methods\n+Good English language skills with German being an asset</li>\n</ul><p><strong>The Benefits</strong></p>\n\n<p>If you bring that to the table and identify with our culture, you are welcome as a valuable member of our team. We are looking for long-term relationships and we try to get you into the project that suits you the most.</p>\n\n<p>We give so that you can contribute. If that scares you off, very well - then you do not make a bad investment and either do we. If you like our approach, then we would be really happy to hear from you.</p>\n\n<p><strong>Your Application</strong></p>\n\n<p>We do not want to assess your skills and motivation solely based on diplomas and certificates. Show us what you did. We are interested in all projects of your previous occupations, own projects, your code on Github, etc.</p>\n\n<p>Please send your application <a href=\"https://jobs.digistore24.com/senior-front-end-developer/lp/\">via our jobs page</a> and upload your resume (PDF) as well as all the work samples you think are necessary.</p>\n\n<p>When everything goes well, we will get back to you and have a short phone call. The next steps will be:</p>\n\n<ul>\n<li>a code test</li>\n<li>an interview with our CEO and the tech team</li>\n<li>a final feedback and a job offer within 2 weeks time</li>\n</ul><p>If you have questions concerning this position, don’t hesitate to send an e-mail to <a href=\"mailto:jobs@digistore24.com\">jobs@digistore24.com</a></p>",
    "how_to_apply": "<p>Please use our form: <a href=\"https://jobs.digistore24.com/senior-front-end-developer/lp/\">https://jobs.digistore24.com/senior-front-end-developer/lp/</a></p>",
    "company": "Digistore24 GmbH",
    "company_url": "http://www.jobs.digistore24.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/d69e035e-10cf-11e8-9924-19672d8bafde.jpg",
    "url": "http://jobs.github.com/positions/df5c2d7e-10d2-11e8-8905-81f954c87efa"
  },
  {
    "id": "fd005bf2-0d99-11e8-9912-b23fd801887b",
    "created_at": "Fri Feb 09 13:06:36 UTC 2018",
    "title": "Development Warlock (fulltime, Munich)",
    "location": "Munich",
    "type": "Full Time",
    "description": "<p>You like to hack/dev/program/prototype? Join us! </p>\n\n<h3>Who we are</h3>\n\n<p>mantro is a company which specializes in… ah, c'mon, let`s just cut the crap, you can take a look at the website if you are interested in that. We are a very diverse, multi-cultural and fun team with expertise from a variety of areas. What we all share is a passion for creating kick-ass products together.</p>\n\n<h3>On the backend we use</h3>\n\n<ul>\n<li>Kotlin (Spring Boot)</li>\n<li>NodeJS</li>\n<li>100% No PHP</li>\n</ul><h3>On the frontend we use</h3>\n\n<ul>\n<li>React, React, React</li>\n<li>Redux or Mobx</li>\n<li>Sometimes Ember</li>\n<li>No Angular lately...</li>\n<li>SASS, SCSS, LESS, PostCSS</li>\n<li>Webpack</li>\n<li>Typescript, or Babel</li>\n</ul><h3>On mobile we use</h3>\n\n<ul>\n<li>React Native</li>\n<li>(.. pause ..)</li>\n<li>Swift (Objective-C to feel oldschool)</li>\n<li>Java</li>\n<li>Web-Technologies / Cordova / Phonegap</li>\n</ul><h3>To store data we use</h3>\n\n<ul>\n<li>Postgres</li>\n<li>InfluxDB</li>\n<li>S3</li>\n<li>sometimes MySQL</li>\n<li>sometimes Mongo</li>\n</ul><h3>To orchestrate we use</h3>\n\n<ul>\n<li>Docker (erm, what else)</li>\n<li>Docker Compose (locally)</li>\n<li>k8s (remote)</li>\n</ul><h3>CPU power is sponsored by</h3>\n\n<ul>\n<li>AWS</li>\n<li>Digital Ocean</li>\n<li>Sometimes Heroku</li>\n</ul><h3>To work we use</h3>\n\n<ul>\n<li>(insert your IDE here)</li>\n<li>(insert your OS here)</li>\n<li>git</li>\n</ul><h3>We favor</h3>\n\n<ul>\n<li>Single page applications over server * generated html (since 2012)</li>\n<li>JSON over XML</li>\n<li>React over Ember</li>\n<li>Ember over Angular</li>\n<li>Angular over... err... ... Well, actually we don't do Angular</li>\n<li>Webpack over Gulp</li>\n<li>Pragmatic over dogmatic</li>\n<li>Solutions over problems</li>\n<li>Slack over skype</li>\n<li>Beer over wine</li>\n<li>Beef over Salad (speaking average here)</li>\n</ul><h3>We provide (one of the bullet points is a lie)</h3>\n\n<ul>\n<li>a band room</li>\n<li>a kicker table</li>\n<li>a table tennis table</li>\n<li>basketball and WiFi on the toilet</li>\n<li>lots of bureaucracy</li>\n<li>a dart board</li>\n<li>shitloads of drinks</li>\n<li>all current (and past) consoles and AR/VR shenanigans</li>\n<li>very fast internet</li>\n</ul><p>Well, if you made it until here you probably realized that we want to talk to you.</p>\n\n<p>Via Skype. Or in person. With a coffee. Or a beer.</p>\n\n<p><a href=\"mailto:hello@mantro.net\">hello@mantro.net</a></p>",
    "how_to_apply": "<p><a href=\"mailto:hello@mantro.net\">hello@mantro.net</a></p>",
    "company": "mantro GmbH",
    "company_url": "https://mantro.net",
    "company_logo": "http://github-jobs.s3.amazonaws.com/e06d45d6-0d99-11e8-87f8-a8eac4f09071.png",
    "url": "http://jobs.github.com/positions/fd005bf2-0d99-11e8-9912-b23fd801887b"
  },
  {
    "id": "67845168-5dc8-11e7-9f09-ed28a3f1978b",
    "created_at": "Wed Feb 07 20:39:48 UTC 2018",
    "title": "Full Stack Engineer @ Genius",
    "location": "Brooklyn, NY",
    "type": "Full Time",
    "description": "<p>The Genius engineering team builds and maintains a website and apps that are used by 100 million people every month. The majority of the content—lyrics, annotations, and metadata—is crowdsourced by an engaged group of contributors using a complex and ever evolving technical platform.</p>\n\n<p><a href=\"http://genius.com\"><strong>Genius</strong></a> is looking for a <a href=\"https://hire.withgoogle.com/public/jobs/geniuscom/view/P_AAAAAACAAADM2i58JVfhyW?trackingTag=gitHub\"><strong>Full Stack Engineer</strong></a> to architect and implement new features. We’re looking for makers with a sophisticated code sense: folks who’ve built cool things, but who can also maintain and scale those things, and who feel at home deep in the guts of a library.</p>\n\n<p>The best candidates will have professional experience on a web stack serving millions of users, will be proficient with Ruby on Rails, MySQL or Postgres, and have some experience with a front-end javascript framework (Angular, React, Ember, etc).</p>\n\n<h3>Responsibilities</h3>\n\n<ul>\n<li>Build and maintain web application features, primarily with Rails</li>\n<li>Work closely with application infrastructure to scale backend services to tens of thousands of requests per minute</li>\n<li>Develop the APIs that our Android and iPhone apps and web frontend consume</li>\n<li>Create frontend interfaces with HTML, CSS, and Javascript (including Angular)</li>\n<li>Write PostgreSQL queries and migrations that scale to large tables with 50M+ rows</li>\n<li>Work closely with product team to define feature specifications</li>\n<li>On-call duty to respond to urgent bugs or outages</li>\n</ul><h3>Requirements:</h3>\n\n<ul>\n<li>Significant experience writing and deploying code on a large-scale production app</li>\n<li>Significant experience with Ruby on Rails</li>\n<li>Significant experience with at least one front end framework: Angular, Ember, React, or similar</li>\n<li>Significant experience working with relational databases and writing SQL queries</li>\n</ul><h3>Ideal requirements:</h3>\n\n<ul>\n<li>3+ years experience with Rails development</li>\n<li>3+ years experience with Angular</li>\n<li>3+ years experience with PostgreSQL/MySQL</li>\n</ul><h3>Example Projects</h3>\n\n<ul>\n<li>Design an activity stream scalable to 100M+ events and a filterable “firehose” interface for consuming them</li>\n<li>HTTP-cache all pages at the edge for logged-out users only</li>\n<li>Write Javascript that can run robustly in any other website’s JS and CSS environment</li>\n<li>Develop a system for anchoring annotations to arbitrary DOM that can change out from under you</li>\n<li>Calculate document ownership based on edit history with hundreds of distinct authors</li>\n<li>Develop representation for rich text that’s portable to native iOS and Android environments</li>\n<li>Create framework for caching partial templates</li>\n<li>Design a domain-specific language and implementation of site-wide rate limits for spammy or abusive behavior</li>\n<li>Fingerprint artist names to prevent duplicate data with low false-positive rate</li>\n</ul>",
    "how_to_apply": "<h2><a href=\"https://hire.withgoogle.com/public/jobs/geniuscom/view/P_AAAAAACAAADM2i58JVfhyW?trackingTag=gitHub\">&gt;&gt; Click here to apply! &lt;&lt;</a></h2>",
    "company": "Genius",
    "company_url": "http://genius.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/49c225b0-5dc8-11e7-9020-26f5fc587e9e.png",
    "url": "http://jobs.github.com/positions/67845168-5dc8-11e7-9f09-ed28a3f1978b"
  },
  {
    "id": "73ea3f84-0a7b-11e8-96d3-71d637f7d42a",
    "created_at": "Wed Feb 07 10:06:43 UTC 2018",
    "title": "Software Engineer (full remote)",
    "location": "Full Remote Job",
    "type": "Full Time",
    "description": "<p>Du bist ausgeschlafen, hast eine schnelle Auffassungsgabe und hoffentlich eine Portion Pioniergeist. 1st Log ist Start Up Unternehmen, dass aus leidenschaftlichen Mitarbeitern und starken Produkten besteht. Kaum gegründet konnten wir schon namhafte Kunden gewinnen und sie mit unserer Innovation begeistern.</p>\n\n<p><strong>Wir stehen auf Willkommensgeschenke – das bringst Du uns mit:</strong></p>\n\n<p>Power, Leidenschaft, Pioniergeist und Feuer für neue Technologien in der Softwareentwicklung. Als Web und App Entwickler arbeitest du in Projekten mit unserem innovativen Team für Grosskunden im Logistikbereich zusammen. Du erlebst, wenn Deine selbstständig erstellten Module «zu laufen» beginnen und sich Technik und Know How zu produktiven Lösungen vereinen. Herausfordernde Aufgaben löst du kompetent, ziel- und terminorientiert und hast dabei stets Perfektion, Prozesse, Synergien und passende Technik im Auge. Du lernst mit unserem Team agil und dynamisch neue Techniken und Fachkenntnisse über Logistik.</p>\n\n<p><strong>Deine Basis</strong></p>\n\n<ul>\n<li><p>Du verfügst über Informatikkenntnisse, insbesondere ist Erfahrung mit Javascript (ES6/ES7) oder PHP ( Je nach Aufgabenbereich ) wünschenswert. Ein klarer Bonus ist Erfahrung mit Frontend Frameworks á la React / Angular / Ember.</p></li>\n<li><p>Weiterentwicklung, Wissensdurst und der Austausch mit Experten und Profis sind bei Dir Grundbedürfnisse.</p></li>\n<li><p>Du kannst aber auch einfach mal im Support und der Unterstützung unserer Kunden vor Ort mithelfen und Dich dabei gut fühlen.</p></li>\n<li><p>Du sprichst perfektes Deutsch und besitzt gute Englischkenntnisse? Dann melde Dich so schnell als möglich. Wir wollen Dich kennen lernen!</p></li>\n</ul><p><strong>Du gefällst uns – das kriegst schon mal vorweg!</strong></p>\n\n<ul>\n<li>Arbeitszeit – wie Du willst. Na ja, Abstimmung mit dem Team wäre von Vorteil </li>\n<li>Arbeitsplatz- ob Pool, Wald oder Wohnung, Du bestimmst von wo Du arbeitest </li>\n<li>Erreichbarkeit – na bei soviel Freiheit müssen wir Dich halt irgendwie erreichen </li>\n<li>Tauschmittel – ordentlich, doch je produktiver Du wirst desto mehr drücken wir ab</li>\n</ul><p><strong>Interessiert? Dann sende Deine Bewerbung an: <a href=\"mailto:jobs@1st-log.com\">jobs@1st-log.com</a></strong></p>\n\n<p>1st Log AG\nIndustriestrasse 47 \nCH-6300 Zug \n<a href=\"https://www.1st-log.com\">https://www.1st-log.com</a></p>",
    "how_to_apply": "<p><a href=\"mailto:jobs@1st-log.com\">jobs@1st-log.com</a></p>",
    "company": "1st Log AG",
    "company_url": "https://www.1st-log.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/f9d16e34-0a7a-11e8-9edf-8b545c0ce9ff.png",
    "url": "http://jobs.github.com/positions/73ea3f84-0a7b-11e8-96d3-71d637f7d42a"
  },
  {
    "id": "ea4525b0-0ab0-11e8-9519-95ecaf4f4223",
    "created_at": "Mon Feb 05 20:12:59 UTC 2018",
    "title": "Senior Ruby on Rails Developer",
    "location": "Remote/US-based",
    "type": "Full Time",
    "description": "<p>FlexJobs is hiring! Since 2007, our awesome team has been working hard to present professional, legitimate, flexible jobs to our subscribers. In the bigger picture, we aim to make the job search experience a little easier and safer through hand-screened jobs, skills testing, and a blog that explores all areas of flexible working. </p>\n\n<p>Our mission is to improve the future of work by helping people find flexible jobs that make their lives better.  We are committed to doing this internally and externally with integrity, intelligence, balance, communication, and care.</p>\n\n<p>We also walk the talk! Our entire team works remotely from locations all across the United States. The ability to flex our schedules as needed to best fit our lives allows us to work in a very focused and productive way. The teams at FlexJobs collaborate and communicate as needed -- whether that’s several times a day or a couple of times a week -- to stay connected and engaged with one another.</p>\n\n<p><strong>Skills &amp; Experience Required</strong>\nRuby on Rails, remote development, Javascript, HTML5, CSS, Bootstrap, XML, jQuery, git</p>\n\n<p><strong>You must be based in the United States</strong></p>\n\n<p>More specifically, our ideal candidates will have:</p>\n\n<ul>\n<li>5+ years Ruby on Rails development experience - we are using version 5 </li>\n<li>10+ years object-oriented, web software development</li>\n<li>Experience with client-side development technologies including  HTML5, CSS, JQuery, Javascript, AJAX, JSON</li>\n<li>Responsive web page development experience utilizing Bootstrap</li>\n<li>Experience with frameworks like Angular 5 a plus</li>\n<li>Experience with PHP and maintaining Wordpress blog sites a plus</li>\n<li>Experience building and maintaining high volume, consumer-facing websites -- bonus points if you’ve worked on subscription-based sites</li>\n<li>Experience with automated testing suites</li>\n</ul><p><strong>Traits Required</strong></p>\n\n<ul>\n<li>Be interested in a full-time, long-term position</li>\n<li>Be comfortable working independently and in small teams</li>\n<li>Have a sense of pride in your work and a passion for coding</li>\n<li>Have a streak of perfectionism when it comes to details</li>\n<li>Be highly organized, responsible, and ethical</li>\n<li>Be proactive when it comes to asking questions, brainstorming, and working with colleagues</li>\n</ul><p><strong>Other Requirements</strong></p>\n\n<ul>\n<li>You must have a reliable development environment including: high-speed Internet access, a fast computer, and phone access</li>\n<li>Your work environment must be one in which you can really focus without distractions</li>\n</ul>",
    "how_to_apply": "<p>If this sounds a lot like you, then please consider applying! What we’ll need from you:</p>\n\n<ul>\n<li>1. An intro email/cover letter telling us why you are the right developer for FlexJobs - don't forget to tell us about your remote work experience</li>\n<li>2. A current resume in .doc, .docx, .pdf, markdown, or .txt</li>\n<li>3. Applications can be sent through FlexJobs or by email to <a href=\"mailto:jobs@flexjobs.com\">jobs@flexjobs.com</a>\n</li>\n</ul>",
    "company": "FlexJobs",
    "company_url": "http://www.flexjobs.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/11e40dc0-0ab1-11e8-8e43-9f2a564d2a96.png",
    "url": "http://jobs.github.com/positions/ea4525b0-0ab0-11e8-9519-95ecaf4f4223"
  },
  {
    "id": "e1ecf82c-0aa9-11e8-965b-ab28c74d9bd4",
    "created_at": "Mon Feb 05 19:23:18 UTC 2018",
    "title": "Web Designer/Developer",
    "location": "Tampa, FL",
    "type": "Full Time",
    "description": "<p>General Summary\nIf you’re looking to take the next step in your career as a web designer and developer, have the experience and skill-set listed below, and are driven by a passion to do great work, help contribute to the goals of an organization, and embrace the use of technology, development, and design as a strategic advantage, we want to hear from you.</p>\n\n<p>The Web Designer/Developer designs, develops, deploys, and maintains the organizations website to create an interactive and amazing user experience for our target audience. The sky is the limit on the opportunities this position will have to exercise your existing knowledge and skill set and continue to expand and grow your skills as we expand our digital strategy. This position manages the day-to-day activities related to the website and is involved with the short- and long-term content goals of the organization.  The ideal candidate will have a strong understanding of industry trends, open-source CMS knowledge, effective communication skills with both internal and external stakeholders, be confident and self-motivated, provide solutions to assist in advancing the organizations goals of the website, willing to learn and stay abreast of technology and best practices, and be adaptable to changing priorities and initiatives.  This position will interact with multiple departments throughout the company to create an engaging user experience on the web that speaks to visitors world-wide.  If you're wanting to be the lone, genius web designer/developer wanting to sit in a dark room, do your own thing, crunch code, take orders and not be bothered by internal clients, this position is not the right fit.</p>\n\n<p>Principal Duties and Responsibilities:</p>\n\n<ul>\n<li>Act as key point of contact for day-to-day operation of the company website utilizing Drupal \nCMS</li>\n<li>Develop, implement, and maintain Drupal core modules, views, panels, block, custom modules, etc. to customize site behavior to achieve desired results</li>\n<li>Utilize developer skills to troubleshoot any issues that may arise and provide innovative solutions to problems that cannot be solved out of the box</li>\n<li>Provide thorough testing and quality assurance to all work rendered including testing web pages for appearance, functionality, and responsiveness in multiple browsers</li>\n<li>Cleary work and communicate with third party vendor to troubleshoot functionality issues and future development projects within CMS </li>\n<li>Develop and make ongoing recommendations to improve the site, whether it be with navigation, content, enhancement, functionality, or other means so the site is visually appealing, easy to read, and navigate</li>\n<li>Test site for usability on an on-going basis (i.e. form submissions correctly going through lead admin, assets download properly, page URLs not broken, etc.)</li>\n<li>Review and ensure all content changes made to the website by you and the content mangers follows brand standards and best practices</li>\n<li>Work with stakeholders and content owners within the organization to understand business requirements to keep content and imagery on the website fresh and relevant for the best user experience</li>\n<li>Assist in developing and documenting content management system standards, guidelines, and processes for online content which are consistent with our brand guidelines</li>\n<li>Apply critical thinking skills to 'interpret' content and present it in a way that makes sense to users</li>\n<li>Assist in developing content strategy aligned with short-term and long-term marketing goals</li>\n<li>Advise content owners to determine which/how much content is appropriate and best format for content (e.g., HTML page, plain PDF or page-turner PDF) in terms of user experience, findability, SEO, etc.</li>\n<li>Ensure best practices are adhered to within the content, including but not limited to internal links, optimized headings, proper formatting and tagging of photography and graphics, etc.</li>\n<li>Develop customized landing pages to be used in paid advertising efforts </li>\n<li>Develop original website design ideas, within the predetermined template, that bring simplicity and user friendliness to complex roadblocks</li>\n<li>Prepare wireframes, storyboards, user flows, process flows and site maps as needed</li>\n<li>Maintain a consistent look and feel throughout website</li>\n<li>Stay abreast of trends in web design, coding, functionality, etc. to ensure we are adhering to web best practices and implementing technology as needed</li>\n</ul><p>Requirements &amp; Qualifications:</p>\n\n<ul>\n<li>3+ years of core experience with configuration, administration, design, development, and management of a website, using Drupal, or similar open source CMS and LAMP (Linux, Apache, MySQL, PHP) stack </li>\n<li>Expert knowledge of HTML5, CSS3, Javascript (jQuery), ANGULAR JS1.x, PHP, MySQL db integration, SQL database infrastructure, and Git</li>\n<li>Advanced knowledge of SASS/SCSS</li>\n<li>Intermediate experience with implementing Drupal core modules, views, panels, blocks, etc. and developing custom Drupal modules </li>\n<li>Strong full stack development knowledge</li>\n<li>Expert user interface design skills </li>\n<li>Ability to create compelling and innovative web pages and landing pages while working within the constraints of a template system</li>\n<li>Advanced knowledge of best practices for web design and web usability</li>\n<li>Ability to work well independently and collaboratively in a team environment </li>\n<li>Exceptional stakeholder management</li>\n<li>Strong organizational and time management skills including the ability to plan, prioritize workloads, balance multiple concurrent projects and work well under the pressure of tight deadlines and changing demands</li>\n<li>Must be extremely detail oriented with a high degree of accuracy</li>\n<li>Familiarity with design tools such as Photoshop, Illustrator, etc.</li>\n<li>Understanding of digital marketing including basic SEO and PPC</li>\n<li>Ability to review headlines and overall content for style consistency</li>\n<li>BA/BS with specialization in web design and development preferred or relevant work experience</li>\n<li>Portfolio of verifiable work on website of similar scope and complexity </li>\n<li>Experience with international sites, a plus</li>\n<li>Familiarity with email marketing software, a plus</li>\n<li>Knowledge of Google Analytics and data driven design, a plus\nAdditional Skills for Success:</li>\n<li>Strong communication skills</li>\n<li>A positive attitude</li>\n<li>Enthusiastic and willing to learn</li>\n<li>Confident and self-motivated with a strong work ethic</li>\n<li>A people person who is excellent at working with other people, teams, and building relationships</li>\n<li>A problem solver – keen to understand customer needs and offer solutions</li>\n</ul>",
    "how_to_apply": "<p>Email resume and salary requirements to: <a href=\"mailto:wperez@ispe.org\">wperez@ispe.org</a></p>",
    "company": "ISPE",
    "company_url": "http://ISPE",
    "company_logo": "http://github-jobs.s3.amazonaws.com/d89661e6-0aa9-11e8-9dd5-2eba2c4360ef.jpg",
    "url": "http://jobs.github.com/positions/e1ecf82c-0aa9-11e8-965b-ab28c74d9bd4"
  },
  {
    "id": "b4de5f62-0520-11e8-8853-f946cd8a523c",
    "created_at": "Mon Jan 29 18:24:41 UTC 2018",
    "title": "Web Application Developer",
    "location": "Chesapeake, VA, other",
    "type": "Full Time",
    "description": "<p>Emprise Corporation, with offices located in Ledyard, CT and Chesapeake, VA, provides condition monitoring services, software development, and software support for clients worldwide. Major customers include the U.S. Military Sealift Command, Covanta Energy, American Styrenics, Crowley Marine, Keystone Shipping Great Lakes Fleet, and Groton Utilities.  Our present initiatives include Database configuration software development.  Network reconfiguration to support centralized data storage and mining.  Oil analysis software modernization.  Personal digital vibration analyzer.  Thermography equipment modernization and Vibration analysis software modernization.</p>\n\n<p>Emprise is a growing company with employment opportunities in both locations. Our Employees enjoy a casual work environment, excellent pay and benefits.  Please see our website <a href=\"http://www.emprisecorporation.com\">www.emprisecorporation.com</a> for more information or Email your resume and links to your portfolio, GitHub, or other public profiles to <a href=\"mailto:jobs@emprisecorporation.com\">jobs@emprisecorporation.com</a>  </p>\n\n<p>Required:</p>\n\n<ul>\n<li>  Bachelor’s degree in Computer Science or equivalent years’ experience in Applications environment</li>\n<li>  Expert-level knowledge and experience of JavaScript.</li>\n<li>  Intermediate to expert-level knowledge and experience with HTML, CSS.</li>\n<li>  Familiarity with AngularJS, Git/GitHub, npm or Yarn, SCSS.</li>\n<li>  Comfortable with text-based communication like IM, chat, and email.</li>\n<li>  Experience supporting IE10+, Firefox, and Chrome.</li>\n<li>  Expertise with Java and/or C#</li>\n</ul><p>Desired:</p>\n\n<ul>\n<li>  Experience with Java, Spring, JDBC, Apache Tomcat or similar languages/tools.</li>\n<li>  Experience with Eclipse, or maven/gradle.</li>\n<li>  Experience with Lodash.</li>\n<li>  Familiarity with a development pipeline, like Webpack/rollup/TypeScript, gulp, etc.</li>\n<li>  Familiarity with automated testing Mocha, Karma, TestNG.</li>\n<li>  Familiarity with alternative libraries like React, VueJS, Angular (v2+), etc.</li>\n<li>  Familiarity with an Agile workflow.</li>\n<li>  Familiarity with continuous integration tools.</li>\n</ul><p>Position Objectives:   Turning feature requests into reality. Researching and resolving issues. Working to improve the quality of the application and the team. Much of the work is done on an AngularJS (v1.x) web application, and will be in JavaScript (ES6/2015+), HTML, CSS/SCSS, with light Java.</p>",
    "how_to_apply": "<p>Email your resume and links to your portfolio, GitHub, or other public profiles to <a href=\"mailto:jobs@emprisecorporation.com\">jobs@emprisecorporation.com</a></p>",
    "company": "Emprise Corporation",
    "company_url": "http://www.emprisecorporation.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/a7f613ee-0520-11e8-8f23-86587a1efb13.png",
    "url": "http://jobs.github.com/positions/b4de5f62-0520-11e8-8853-f946cd8a523c"
  },
  {
    "id": "17e23ac8-01ef-11e8-8dae-3c6ffa1df26e",
    "created_at": "Thu Jan 25 16:45:04 UTC 2018",
    "title": "Sr. Java Software Engineer - Apple Customer Systems",
    "location": "Cupertino, CA",
    "type": "Full Time",
    "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>Do you love designing &amp; architecting highly scalable applications? Does the idea of performance tuning Java applications make your heart leap? Would you like to work in a fast-paced environment where your technical abilities will be challenged on a day to day basis? Would you enjoy exploring new technologies?</p>\n\n<p>Apple Customer Systems Team is looking for a highly motivated, detail-oriented, energetic individual with excellent communication skills who is not afraid to think outside the box and question assumptions. In this role, you will be part of a fast growing, cohesive team with many exciting responsibilities related to n-tier application development.</p>\n\n<p>Key Qualifications:  </p>\n\n<ul>\n<li>Hands-on expertise in Java and Java enterprise technology applications architecture, design, development and support</li>\n<li>Strong knowledge of concurrency, scalability and fault tolerant designs</li>\n<li>NoSQL database experience, particularly with MongoDB</li>\n<li>Able to analyze business requirements and create efficient solutions</li>\n<li>Must be able to brainstorm and communicate technology ideas and issues with peers and IT management</li>\n<li>Excellent problem solving, critical thinking and communication skills</li>\n<li>Must be able to clearly define solutions for requirements and evaluate options</li>\n<li>Solid knowledge of applications performance improvement techniques and caching solutions</li>\n<li>Agile development experience is a plus</li>\n<li>Core skill: Java/J2EE</li>\n</ul><p>Description:\nLead design, development, implementation and maintenance of java applications &amp; back-end services demonstrating service-oriented architecture and secure applications development technology best practices\nWork with project managers and technical teams in a cross-functional environment, to implement quality products that meet business goals\nKeep up-to date on latest Java/J2EE solutions to generate innovative ideas to solve business challenges</p>\n\n<p>Education:\nBA/BS in Computer Science or related field with 7+ years of overall experience</p>\n\n<p>Additional Requirements:\nStrong Plus: Experience with Angular 2, ReactJS or VueJS\nStrong Plus: Experience with Java backend MVC frameworks such as Spring\nStrong Plus: Spark, Kafka, Hadoop etc.,\nScripting Languages: Python</p>\n\n<p>Apple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.</p>\n\n<p>REQUISITION NUMBER: 113408843\nCOMPANY NAME: Apple Inc.</p>",
    "how_to_apply": "<p><a href=\"https://ars2.equest.com/?response_id=8cbfae954ccd4df40afb746180a94fb2\">APPLY HERE</a></p>",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/a2e371d8-01ee-11e8-9847-16a4c947afc6.jpeg",
    "url": "http://jobs.github.com/positions/17e23ac8-01ef-11e8-8dae-3c6ffa1df26e"
  },
  {
    "id": "58df5800-0080-11e8-943a-56c675716f17",
    "created_at": "Tue Jan 23 21:00:44 UTC 2018",
    "title": "Sr. Software Engineer",
    "location": "San Ramon, CA",
    "type": "Full Time",
    "description": "<p>Sr. Software Engineer</p>\n\n<p>We are looking for a talented and entrepreneurially minded Sr. Software Engineer to join our high performing team and work with the latest technologies! You will be engaged throughout the full life cycle of the product including architecting, developing, documenting, troubleshooting, supporting, bug fixing, and more. </p>\n\n<p>The ideal candidate will have experience developing a product in a microservice architecture using Node.js and TypeScript on the server side. This API will be accessed from an Angular client, smart phone apps, and various other systems. Our engineers can work on any or all of these pieces as needed which is a constant opportunity for learning. </p>\n\n<p>We need software engineers that: </p>\n\n<ul>\n<li>Have hands on experience working with large web applications </li>\n<li>Know the value of modularity and keeping it simple </li>\n<li>Use object oriented programming practices </li>\n<li>Feel comfortable with relational databases </li>\n<li>Love working as part of a strong team </li>\n<li>Want to keep up on the latest technologies and drive innovation </li>\n<li>Enjoy working in an interactive, agile environment </li>\n</ul><p>Useful Experience: </p>\n\n<ul>\n<li>Microservice Architecture </li>\n<li>Node.js </li>\n<li>Angular </li>\n<li>Docker </li>\n<li>AWS </li>\n<li>SCRUM </li>\n<li>Typescript, C#, Java </li>\n<li>SQL </li>\n<li>ORM </li>\n</ul><p>Typically we find it takes a college degree plus 5 or more years of experience to get all this dialed in but, if you feel like you have what we need, don’t let that hold you back. </p>\n\n<p>We are unable to provide or transfer sponsorship at this time.</p>",
    "how_to_apply": "<p>To apply please email your resume, GitHub or website to <a href=\"mailto:jkuemmel@pscu.com\">jkuemmel@pscu.com</a> with the subject “Sr. Software Engineer”.</p>",
    "company": "PSCU",
    "company_url": "http://www.pscu.com",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/58df5800-0080-11e8-943a-56c675716f17"
  },
  {
    "id": "ceeff638-0078-11e8-85d1-92da8522ea65",
    "created_at": "Tue Jan 23 20:07:04 UTC 2018",
    "title": "Node.js Developer",
    "location": "Boca Raton, FL",
    "type": "Full Time",
    "description": "<p>Node.js Developer # 1116</p>\n\n<p>Position Summary:</p>\n\n<p>We are seeking a creative and talented engineer to provide technical expertise in software design and development. The successful candidate will have a proven track record for creating efficient, scalable, and manageable enterprise-level systems using open source technologies (Node.js, MySQL, MongoDB, Linux) hosted on AWS. You will be expected to be self-driven, think outside the box, and open to working in a fast paced startup environment with tight deadlines.</p>\n\n<p>Experience and Education:</p>\n\n<p>Bachelor’s degree in Computer Science or equivalent experience\n4+ years experience building large-scale server applications using a micro service based architecture\n4+ years experience working on high volume websites\nA deep, abiding love for building scalable, high performance systems</p>\n\n<p>Technology Skills and Strengths:</p>\n\n<p>Strong proficiency with Node.js\nHTML5, CSS3\nWeb Services (SOAP and/or REST)\nCloud Development(AWS or similar)\nMongo DB, MySql DB\nDocker\nMicroservices\nContinuous Integration tools\nAgile methodologies\nProficient understanding of code versioning tools such as Git\nCreating database schemas that represent and support business processes\nExpert-level understanding of the systems development life cycle\nExperience with caching high traffic sites and microservices\nAngular JS a plus\nHighly adept at innovating and thinking beyond established standards and processes\nDemonstrated organizational, analytical and interpersonal skills\nFlexible team player\nAbility to manage tasks independently without close supervision and take ownership of responsibilities\nExpert-level ability to communicate highly complex technical information clearly and articulately at all levels and audiences\nAbility to adapt to a rapidly changing environment\nComfortable with a fast paced start up environment and tight deadlines</p>\n\n<p>Primary Job Responsibilities:</p>\n\n<p>Build out features across the entire development stack\nDrive new features as well as maintain existing code\nUnderstand the business well enough to align your development with company goals\nCreate and share dev best practices and standards. Always be learning\nCollaborate on the design of new build outs and write tests to maximize efficiency\nPerform code reviews to ensure best practices are being employed</p>",
    "how_to_apply": "<p>please send your resume to <a href=\"mailto:RecruitingCoordinator@rangertech.com\">RecruitingCoordinator@rangertech.com</a> and reference this GitHub Node.JS role!</p>",
    "company": "Ranger Technical Resources",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/03f42df6-0077-11e8-984b-4b784e0216bf.png",
    "url": "http://jobs.github.com/positions/ceeff638-0078-11e8-85d1-92da8522ea65"
  },
  {
    "id": "b20dc1da-ff79-11e7-876e-aeca2bee170c",
    "created_at": "Mon Jan 22 13:41:50 UTC 2018",
    "title": "Hybris Developer",
    "location": "Eindhoven",
    "type": "Full Time",
    "description": "<p><strong>With its solidly-grounded commerce skills and technical knowledge, Elision is a trusted advisor for building high-end commerce trade channels.</strong><br><br>\nElision delivers solutions that guarantee a consistent interaction over all channels and touchpoints. We create value by means of a comprehensive package of services, from digital strategy consulting and service design to development and managed services. This makes Elision the partner for companies accompanying them in their digital transformation.<br><br>\nElision is an innovative player and offers the best possible solution within the SAP Customer Engagement and Commerce landscape: hybris commerce, hybris marketing and C4C.<br><br>\nElision is part of the Xplore group (Cronos).<br><br>\nAs our growth continues, we are looking for experienced Hybris developers to join our teams for projects in the Netherlands!<br><br><strong>YOUR POSITION</strong><br>\nWorking in a team on the development of high-end e-commerce applications for global brands, B2B contexts and general Omni-channel digitalisation projects. You are a technical expert in SAP Hybris and closely follow developments in the field of Java development, focussing on back-end or front-end (or both).<br><br><strong>WHO ARE YOU?</strong><br>\nYou have 5 years off relevant consulting or industry experience and at least 3+ years' experience in implementing the Hybris platform (5.x and 6.x). A Strong background in Java/Spring environments and hands-on development experience, as well as a good knowledge of object-oriented principles, design patterns, database design and data modelling is required. You're familiar with front-end ( HTML, CSS, Bootstrap, Angular, React , ... ) and back-end Java-based frameworks.<br><br><em>\"Great things in business are never done by one person, they are done by a team of people.\" Steve Jobs</em><br></p>\n\n<ul>\n<li>You are a real team player</li>\n<li>You have experience in agile development</li>\n<li>In all of this you are customer oriented and you strive to get the job done</li>\n<li>Communication is essential as you are working together with clients and a team of developers, architects, analysts, project managers and other</li>\n<li>You preferably obtained a bachelor or a master's degree</li>\n<li>Besides Dutch you also possess a good knowledge of English</li>\n</ul><p><strong>WE OFFER YOU</strong></p>\n\n<ul>\n<li>A permanent position in a young team, with room for creativity, initiative and growth</li>\n<li>A pleasant working environment in a traffic jam-free location</li>\n<li>An opportunity for growth and learn from the experts in the business</li>\n<li>Trainings and events on a regular base</li>\n</ul><p><strong>INTERESTED?</strong><br>\nPlease apply using the <strong>link</strong> on the right side.<br><br><em>Keywords: Vacancy, full-time, Eindhoven, development, front-end, Hybris.</em></p>",
    "how_to_apply": "<p><a href=\"https://elision.redirect.your-jobresponse.com/hybris_developer_eindhoven/187213/V819/apply\">Click here to apply online!</a></p>",
    "company": "Elision",
    "company_url": "https://elision.redirect.your-jobresponse.com/h/187213/V819/apply",
    "company_logo": "http://github-jobs.s3.amazonaws.com/9b30fdce-ff79-11e7-92fb-6f454c0e16d6.png",
    "url": "http://jobs.github.com/positions/b20dc1da-ff79-11e7-876e-aeca2bee170c"
  },
  {
    "id": "3afa0270-fd6c-11e7-8225-a795ad2d2efb",
    "created_at": "Fri Jan 19 22:59:50 UTC 2018",
    "title": "Full Stack Platform Developer",
    "location": "San Francisco",
    "type": "Full Time",
    "description": "<p><b>Who we are:</b></p>\n\n<p>Panoply is set out to revolutionize the world of advanced data management, making it easy and fun to digest hundreds of different data sources, in real-time and petabyte-scale. The developers at Panoply are working on building a cutting-edge platform that can absorb massive amounts of data, in minutes, and provide users with an engaging experience for loading, transforming and exploring their data. </p>\n\n<p><b>You will:</b></p>\n\n<ul>\n<li>Lead the design and architecture of the data processing pipeline and the core query engine, as \n   well as build developer tools &amp; APIs.</li>\n<li>Collaborate with a team of developers and customers to prototype, design, and build creative \n   user-facing products.</li>\n<li>Build integration code with many cutting-edge technologies and processes, including Python 3, \n   Go, Presto, AWS, ML, NLP.</li>\n</ul><p><b>You'll need:</b></p>\n\n<ul>\n<li>Passion about technology • Drive to be the best • Awesome startup attitude</li>\n<li>3-5 years of experience in one or more of the following technologies: Go, Python, \n   Javascript/Node.js, Ruby</li>\n<li>Comprehensive expertise in Object Oriented Design, Software Architecture, Algorithms &amp; Data \n   Structures</li>\n<li>Experience or contribution to high-profile open-source projects</li>\n<li>Experience with Linux and Web-related technologies, AWS, Database Design</li>\n<li>Advantage: Experience in massive-scale data processing, using Redshift, Hadoop, Spark, EMR, \n   Google BigQuery</li>\n<li>Advantage: Experience in cutting-edge client-side technologies like HTML5, Web Components, \n   Dart, Less/Sass, D3, Angular</li>\n<li>Previous client facing experience and perfect communication skills</li>\n</ul><p><b>More about Panoply:</b></p>\n\n<p>Panoply is the world’s only ETL-less smart data warehouse. Built for the cloud, Panoply delivers the industry’s fastest time to insights by eliminating the development and coding typically associated with transforming, integrating, and managing big data. Panoply’s proprietary machine learning and natural language processing algorithms automatically enrich, transform and optimize big data, making it simple to gain actionable insights. </p>\n\n<p>Generous benefits package, free food, and unlimited coffee.</p>",
    "how_to_apply": "<p><a href=\"https://panoply.io/careers/full-stack-platform-developer/\">https://panoply.io/careers/full-stack-platform-developer/</a></p>",
    "company": "Panoply",
    "company_url": "http://panoply.io",
    "company_logo": "http://github-jobs.s3.amazonaws.com/d99b057a-fd6a-11e7-9f75-07e1b0f93271.jpg",
    "url": "http://jobs.github.com/positions/3afa0270-fd6c-11e7-8225-a795ad2d2efb"
  },
  {
    "id": "01cb1f38-fab1-11e7-8f8b-2280e19fe166",
    "created_at": "Tue Jan 16 11:34:07 UTC 2018",
    "title": "Collaboration Software Developer (Java)",
    "location": "Houten",
    "type": "Full Time",
    "description": "<p><b>Java Angular Node.JS \nWatson Bluemix Connections </b></p>\n\n<p>Als Software developer werk je aan verschillende projecten (solo en team) gerelateerd aan kunstmatige intelligentie, ongestructureerde data, en samenwerkingssoftware binnen het IBM portfolio (Connections, Watson en Bluemix). Je werkt in ons professionele clubhuis of bij een klant op locatie. In het ene project verken je technologie en/of oplossingen en in andere projecten vertaal functionele klantwensen naar een technisch ontwerp. Ook adviseer je onze klanten over de inzet van diverse IBM producten en het gebruik van open standaarden en de mogelijkheden hiervan. </p>\n\n<p>Vaak zul je werken met de standaarden Java, node.JS, Angular en/of MongoDB. Mooi is dat je bij e-office vrij bent om ook met andere technologieën te werken, mits het past in het totale plaatje van de klant of oplossing. </p>\n\n<p><b>Wie ben jij?</b><br>\nTen eerste wordt jij enthousiast van onze visie en je weet dat jij zal bloeien in een omgeving met zo veel vrijheid, verantwoordelijkheid en mogelijkheden. Je acteert op HBO/WO werk- en denkniveau en werkt graag in projecten. Je communiceert makkelijk in de Nederlandse taal, bent gedreven en ambitieus. Je vindt het een uitdaging om zelfstandig requirements uit te vragen, problemen op te lossen en oplossingen te bouwen.</p>\n\n<p>Als Software Developer heb je minimaal zo’n 2 jaar professionele ervaring met software ontwikkeling. Je hebt al gewerkt of minimaal gekeken naar de mogelijkheden van Java en/of Node.js. Mooie bijkomstigheid is als je al in aanraking bent geweest met DevOps tools zoals Jenkins en Docker. </p>\n\n<p>Uiteraard kan en mag je ook in aanraking komen met andere innovatieve technologieën binnen de IBM Connections Suite (of zelfs van de Modern Workplace van Micrososft).).</p>\n\n<p><b>Aanbod</b>\nAls je het inhoudelijk en persoonlijk beste uit jezelf wilt halen kan e-office heel erg interessant voor je zijn. Er is veel (technologische) vrijheid en je krijgt veel verantwoordelijkheid. Eigen initiatief wordt zeer gewaardeerd. </p>\n\n<p>Als Software Developer ga je aan de slag met innovatieve oplossingen voor onze klanten, deze oplossingen kunnen een cloud, artificial intelligence (A.I.), Internet of Things, en samenwerkingscomponent hebben. We betalen een goed salaris met prima secundaire arbeidsvoorwaarden, zoals bijvoorbeeld 29 vakantiedagen en een lease auto of een goede reiskostenvergoeding. Het prettige kantoor in Houten heeft allerlei voorzieningen zoals bijvoorbeeld een gezamenlijk biologische lunch.</p>\n\n<p>De balans tussen werk en privé vinden wij uitermate belangrijk en dit ondersteunen we met flexibele werktijden en de modernste samenwerkingssoftware, een laptop en een telefoon van de zaak. </p>\n\n<p><b>e-office</b><br>\nWil je als organisatie of als medewerker goed om kunnen gaan met een steeds complexere wereld, dan biedt <a href=\"http://www.e-office.com\" target=\"_blank\">e-office</a> je andere manieren van werken en samenwerken. We doen dit met name met cloud technologie van IBM(Watson, Bluemix en Connections) en Microsoft (Azure, Office365 en Dynamics365). Concreet én innovatief. Samen met <a href=\"http://www.work21.nl\" target=\"_blank\">work21</a> en <a href=\"http://www.blaud.com\" target=\"_blank\">BLAUD</a>, die ons flankeren met veranderkracht en mobiele expertise.</p>\n\n<p>e-office group is in 1991 opgericht met ‘de kracht van mensen’ als uitgangspunt. Als voorbeeld in de markt zoekt e-office altijd naar nieuwe manieren van werken, samenwerken en organiseren. Uiteraard op het snijvlak van technologie, mens en organisatie.</p>",
    "how_to_apply": "<p><a href=\"https://content.e-office.com/acton/form/18844/006f:d-0001/0/-/-/-/-/index.htm\" target=\"_blank\">Reageer hier direct</a><br><br> Uiteraard kan je ook de <a href=\"https://www.e-office.com/vacatures/software-developer/\" target=\"_blank\">vacature op onze website</a> bekijken of contact opnemen met Marcel de Jong via <a href=\"mailto:marcel.de.jong@e-office.com?SUBJECT=software%20developer%20bij%20e-office\">e-mail</a> of <a href=\"https://api.whatsapp.com/send?phone=31642740652\" target=\"_blank\"> WhatsApp</a>.</p>",
    "company": "e-office",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/e8f8af96-faad-11e7-86ea-5784eb86bcd8.png",
    "url": "http://jobs.github.com/positions/01cb1f38-fab1-11e7-8f8b-2280e19fe166"
  },
  {
    "id": "6f3147fa-119f-11e8-858a-f6bea5c8462d",
    "created_at": "Wed Feb 14 15:57:41 UTC 2018",
    "title": "Hybris Developer",
    "location": "Eindhoven",
    "type": "Full Time",
    "description": "<p><b>With its solidly-grounded commerce skills and technical knowledge, Elision is a trusted advisor for building high-end commerce trade channels.&lt;.b&gt;</b></p>\n\n<p>Elision delivers solutions that guarantee a consistent interaction over all channels and touchpoints. We create value by means of a comprehensive package of services, from digital strategy consulting and service design to development and managed services. This makes Elision the partner for companies accompanying them in their digital transformation.</p>\n\n<p>Elision is an innovative player and offers the best possible solution within the SAP Customer Engagement and Commerce landscape: hybris commerce, hybris marketing and C4C.</p>\n\n<p>Elision is part of the Xplore group (Cronos).</p>\n\n<p>As our growth continues, we are looking for experienced Hybris developers to join our teams for projects in the Netherlands!</p>\n\n<p><b>YOUR POSITION</b><br>\nWorking in a team on the development of high-end e-commerce applications for global brands, B2B contexts and general Omni-channel digitalisation projects. You are a technical expert in SAP Hybris and closely follow developments in the field of Java development, focussing on back-end or front-end (or both).</p>\n\n<p><b>WHO ARE YOU?</b><br>\nYou have 5 years off relevant consulting or industry experience and at least 3+ years' experience in implementing the Hybris platform (5.x and 6.x). A Strong background in Java/Spring environments and hands-on development experience, as well as a good knowledge of object-oriented principles, design patterns, database design and data modelling is required. You're familiar with front-end ( HTML, CSS, Bootstrap, Angular, React , ... ) and back-end Java-based frameworks.</p>\n\n<p><i>\"Great things in business are never done by one person, they are done by a team of people.\" Steve Jobs</i></p>\n\n<ul>\n<li>You are a real team player</li>\n<li>You have experience in agile development</li>\n<li>In all of this you are customer oriented and you strive to get the job done</li>\n<li>Communication is essential as you are working together with clients and a team of developers, architects, analysts, project managers and other</li>\n<li>You preferably obtained a bachelor or a master's degree</li>\n<li>Besides Dutch you also possess a good knowledge of English</li>\n</ul><p><b>WE OFFER YOU</b></p>\n\n<ul>\n<li>A permanent position in a young team, with room for creativity, initiative and growth</li>\n<li>A pleasant working environment in a traffic jam-free location</li>\n<li>An opportunity for growth and learn from the experts in the business</li>\n<li>Trainings and events on a regular base</li>\n</ul><p>INTERESTED?\nPlease apply using the application form.</p>\n\n<p><a href=\"https://elision.redirect.your-jobresponse.com/hybris_developer_eindhoven/187213/V819/apply\">Click here for the application form!</a></p>\n\n<p><i> Keywords: Vacancy, full-time, Eindhoven, development, front-end, Hybris.</i></p>",
    "how_to_apply": "<p><a href=\"https://elision.redirect.your-jobresponse.com/hybris_developer_eindhoven/187213/V819/apply\">Click here for the application form!</a></p>",
    "company": "Elision",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/5514e0b6-119f-11e8-8821-9d5cdaeca1b1.png",
    "url": "http://jobs.github.com/positions/6f3147fa-119f-11e8-858a-f6bea5c8462d"
  },
  {
    "id": "df5c2d7e-10d2-11e8-8905-81f954c87efa",
    "created_at": "Tue Feb 13 15:32:12 UTC 2018",
    "title": "Senior Frontend Developer with Angular JS 2 (Homeoffice / Flexible)",
    "location": "Remote",
    "type": "Full Time",
    "description": "<p><strong>This is a full-time remote position, we accept applications from anywhere in the world.</strong></p>\n\n<p><strong>&gt;&gt; Check out <a href=\"https://jobs.digistore24.com/senior-front-end-developer/lp/\">our job video</a> and <a href=\"https://jobs.digistore24.com/en/jobs/\">our careers page</a> to see if we would be a good fit.&lt;&lt;</strong></p>\n\n<p><em>At Digistore24 we develop software that has an impact on thousands of small and medium sized businesses every day. If you are man of action who loves to work in a small, family-like team and who has the passion and work ethic to develop great software products, we are the right fit for you.</em></p>\n\n<p>We are one of the fastest growing software companies in Europe. Our core platform is an automation solution developed by a small and extremely competent team. It provides a complete infrastructure to over 100.000 entrepreneurs to build a scalable online business with millions of customers.</p>\n\n<p><strong>The Job</strong></p>\n\n<p>We are looking for an experienced front-end developer with high motivation, a keen interest in our business use case and a sense for good user experience and beautiful design. You should be very familiar with AngularJS 2 and have an uncompromising drive to design beautiful interfaces.</p>\n\n<p>It is also important to us that you have already created a complex web application, that you have experience in agile development processes, and that you consider first-class, clean, and easily testable code as the basis of your work. You should also bring with you:</p>\n\n<ul>\n<li>Proficient understanding of web markup, including HTML5, CSS3</li>\n<li>Good understanding of advanced JavaScript libraries and frameworks, such as AngularJS 2</li>\n<li>Min. 5 years of professional experience along with a proven track record of delivering complex web projects in a leading role</li>\n<li>Basic understanding of server-side CSS pre-processing platforms, such as LESS and SASS</li>\n<li>Ability to improve architecture and code quality by refactoring</li>\n<li>Basic knowledge of image authoring tools, to be able to crop, resize, or perform small adjustments on an image. (Familiarity with tools such as as Gimp or Photoshop is a plus)</li>\n<li>Proficient understanding of cross-browser compatibility issues and ways to work around them</li>\n<li>Experience with agile development methods\n+Good English language skills with German being an asset</li>\n</ul><p><strong>The Benefits</strong></p>\n\n<p>If you bring that to the table and identify with our culture, you are welcome as a valuable member of our team. We are looking for long-term relationships and we try to get you into the project that suits you the most.</p>\n\n<p>We give so that you can contribute. If that scares you off, very well - then you do not make a bad investment and either do we. If you like our approach, then we would be really happy to hear from you.</p>\n\n<p><strong>Your Application</strong></p>\n\n<p>We do not want to assess your skills and motivation solely based on diplomas and certificates. Show us what you did. We are interested in all projects of your previous occupations, own projects, your code on Github, etc.</p>\n\n<p>Please send your application <a href=\"https://jobs.digistore24.com/senior-front-end-developer/lp/\">via our jobs page</a> and upload your resume (PDF) as well as all the work samples you think are necessary.</p>\n\n<p>When everything goes well, we will get back to you and have a short phone call. The next steps will be:</p>\n\n<ul>\n<li>a code test</li>\n<li>an interview with our CEO and the tech team</li>\n<li>a final feedback and a job offer within 2 weeks time</li>\n</ul><p>If you have questions concerning this position, don’t hesitate to send an e-mail to <a href=\"mailto:jobs@digistore24.com\">jobs@digistore24.com</a></p>",
    "how_to_apply": "<p>Please use our form: <a href=\"https://jobs.digistore24.com/senior-front-end-developer/lp/\">https://jobs.digistore24.com/senior-front-end-developer/lp/</a></p>",
    "company": "Digistore24 GmbH",
    "company_url": "http://www.jobs.digistore24.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/d69e035e-10cf-11e8-9924-19672d8bafde.jpg",
    "url": "http://jobs.github.com/positions/df5c2d7e-10d2-11e8-8905-81f954c87efa"
  },
  {
    "id": "fd005bf2-0d99-11e8-9912-b23fd801887b",
    "created_at": "Fri Feb 09 13:06:36 UTC 2018",
    "title": "Development Warlock (fulltime, Munich)",
    "location": "Munich",
    "type": "Full Time",
    "description": "<p>You like to hack/dev/program/prototype? Join us! </p>\n\n<h3>Who we are</h3>\n\n<p>mantro is a company which specializes in… ah, c'mon, let`s just cut the crap, you can take a look at the website if you are interested in that. We are a very diverse, multi-cultural and fun team with expertise from a variety of areas. What we all share is a passion for creating kick-ass products together.</p>\n\n<h3>On the backend we use</h3>\n\n<ul>\n<li>Kotlin (Spring Boot)</li>\n<li>NodeJS</li>\n<li>100% No PHP</li>\n</ul><h3>On the frontend we use</h3>\n\n<ul>\n<li>React, React, React</li>\n<li>Redux or Mobx</li>\n<li>Sometimes Ember</li>\n<li>No Angular lately...</li>\n<li>SASS, SCSS, LESS, PostCSS</li>\n<li>Webpack</li>\n<li>Typescript, or Babel</li>\n</ul><h3>On mobile we use</h3>\n\n<ul>\n<li>React Native</li>\n<li>(.. pause ..)</li>\n<li>Swift (Objective-C to feel oldschool)</li>\n<li>Java</li>\n<li>Web-Technologies / Cordova / Phonegap</li>\n</ul><h3>To store data we use</h3>\n\n<ul>\n<li>Postgres</li>\n<li>InfluxDB</li>\n<li>S3</li>\n<li>sometimes MySQL</li>\n<li>sometimes Mongo</li>\n</ul><h3>To orchestrate we use</h3>\n\n<ul>\n<li>Docker (erm, what else)</li>\n<li>Docker Compose (locally)</li>\n<li>k8s (remote)</li>\n</ul><h3>CPU power is sponsored by</h3>\n\n<ul>\n<li>AWS</li>\n<li>Digital Ocean</li>\n<li>Sometimes Heroku</li>\n</ul><h3>To work we use</h3>\n\n<ul>\n<li>(insert your IDE here)</li>\n<li>(insert your OS here)</li>\n<li>git</li>\n</ul><h3>We favor</h3>\n\n<ul>\n<li>Single page applications over server * generated html (since 2012)</li>\n<li>JSON over XML</li>\n<li>React over Ember</li>\n<li>Ember over Angular</li>\n<li>Angular over... err... ... Well, actually we don't do Angular</li>\n<li>Webpack over Gulp</li>\n<li>Pragmatic over dogmatic</li>\n<li>Solutions over problems</li>\n<li>Slack over skype</li>\n<li>Beer over wine</li>\n<li>Beef over Salad (speaking average here)</li>\n</ul><h3>We provide (one of the bullet points is a lie)</h3>\n\n<ul>\n<li>a band room</li>\n<li>a kicker table</li>\n<li>a table tennis table</li>\n<li>basketball and WiFi on the toilet</li>\n<li>lots of bureaucracy</li>\n<li>a dart board</li>\n<li>shitloads of drinks</li>\n<li>all current (and past) consoles and AR/VR shenanigans</li>\n<li>very fast internet</li>\n</ul><p>Well, if you made it until here you probably realized that we want to talk to you.</p>\n\n<p>Via Skype. Or in person. With a coffee. Or a beer.</p>\n\n<p><a href=\"mailto:hello@mantro.net\">hello@mantro.net</a></p>",
    "how_to_apply": "<p><a href=\"mailto:hello@mantro.net\">hello@mantro.net</a></p>",
    "company": "mantro GmbH",
    "company_url": "https://mantro.net",
    "company_logo": "http://github-jobs.s3.amazonaws.com/e06d45d6-0d99-11e8-87f8-a8eac4f09071.png",
    "url": "http://jobs.github.com/positions/fd005bf2-0d99-11e8-9912-b23fd801887b"
  },
  {
    "id": "67845168-5dc8-11e7-9f09-ed28a3f1978b",
    "created_at": "Wed Feb 07 20:39:48 UTC 2018",
    "title": "Full Stack Engineer @ Genius",
    "location": "Brooklyn, NY",
    "type": "Full Time",
    "description": "<p>The Genius engineering team builds and maintains a website and apps that are used by 100 million people every month. The majority of the content—lyrics, annotations, and metadata—is crowdsourced by an engaged group of contributors using a complex and ever evolving technical platform.</p>\n\n<p><a href=\"http://genius.com\"><strong>Genius</strong></a> is looking for a <a href=\"https://hire.withgoogle.com/public/jobs/geniuscom/view/P_AAAAAACAAADM2i58JVfhyW?trackingTag=gitHub\"><strong>Full Stack Engineer</strong></a> to architect and implement new features. We’re looking for makers with a sophisticated code sense: folks who’ve built cool things, but who can also maintain and scale those things, and who feel at home deep in the guts of a library.</p>\n\n<p>The best candidates will have professional experience on a web stack serving millions of users, will be proficient with Ruby on Rails, MySQL or Postgres, and have some experience with a front-end javascript framework (Angular, React, Ember, etc).</p>\n\n<h3>Responsibilities</h3>\n\n<ul>\n<li>Build and maintain web application features, primarily with Rails</li>\n<li>Work closely with application infrastructure to scale backend services to tens of thousands of requests per minute</li>\n<li>Develop the APIs that our Android and iPhone apps and web frontend consume</li>\n<li>Create frontend interfaces with HTML, CSS, and Javascript (including Angular)</li>\n<li>Write PostgreSQL queries and migrations that scale to large tables with 50M+ rows</li>\n<li>Work closely with product team to define feature specifications</li>\n<li>On-call duty to respond to urgent bugs or outages</li>\n</ul><h3>Requirements:</h3>\n\n<ul>\n<li>Significant experience writing and deploying code on a large-scale production app</li>\n<li>Significant experience with Ruby on Rails</li>\n<li>Significant experience with at least one front end framework: Angular, Ember, React, or similar</li>\n<li>Significant experience working with relational databases and writing SQL queries</li>\n</ul><h3>Ideal requirements:</h3>\n\n<ul>\n<li>3+ years experience with Rails development</li>\n<li>3+ years experience with Angular</li>\n<li>3+ years experience with PostgreSQL/MySQL</li>\n</ul><h3>Example Projects</h3>\n\n<ul>\n<li>Design an activity stream scalable to 100M+ events and a filterable “firehose” interface for consuming them</li>\n<li>HTTP-cache all pages at the edge for logged-out users only</li>\n<li>Write Javascript that can run robustly in any other website’s JS and CSS environment</li>\n<li>Develop a system for anchoring annotations to arbitrary DOM that can change out from under you</li>\n<li>Calculate document ownership based on edit history with hundreds of distinct authors</li>\n<li>Develop representation for rich text that’s portable to native iOS and Android environments</li>\n<li>Create framework for caching partial templates</li>\n<li>Design a domain-specific language and implementation of site-wide rate limits for spammy or abusive behavior</li>\n<li>Fingerprint artist names to prevent duplicate data with low false-positive rate</li>\n</ul>",
    "how_to_apply": "<h2><a href=\"https://hire.withgoogle.com/public/jobs/geniuscom/view/P_AAAAAACAAADM2i58JVfhyW?trackingTag=gitHub\">&gt;&gt; Click here to apply! &lt;&lt;</a></h2>",
    "company": "Genius",
    "company_url": "http://genius.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/49c225b0-5dc8-11e7-9020-26f5fc587e9e.png",
    "url": "http://jobs.github.com/positions/67845168-5dc8-11e7-9f09-ed28a3f1978b"
  },
  {
    "id": "73ea3f84-0a7b-11e8-96d3-71d637f7d42a",
    "created_at": "Wed Feb 07 10:06:43 UTC 2018",
    "title": "Software Engineer (full remote)",
    "location": "Full Remote Job",
    "type": "Full Time",
    "description": "<p>Du bist ausgeschlafen, hast eine schnelle Auffassungsgabe und hoffentlich eine Portion Pioniergeist. 1st Log ist Start Up Unternehmen, dass aus leidenschaftlichen Mitarbeitern und starken Produkten besteht. Kaum gegründet konnten wir schon namhafte Kunden gewinnen und sie mit unserer Innovation begeistern.</p>\n\n<p><strong>Wir stehen auf Willkommensgeschenke – das bringst Du uns mit:</strong></p>\n\n<p>Power, Leidenschaft, Pioniergeist und Feuer für neue Technologien in der Softwareentwicklung. Als Web und App Entwickler arbeitest du in Projekten mit unserem innovativen Team für Grosskunden im Logistikbereich zusammen. Du erlebst, wenn Deine selbstständig erstellten Module «zu laufen» beginnen und sich Technik und Know How zu produktiven Lösungen vereinen. Herausfordernde Aufgaben löst du kompetent, ziel- und terminorientiert und hast dabei stets Perfektion, Prozesse, Synergien und passende Technik im Auge. Du lernst mit unserem Team agil und dynamisch neue Techniken und Fachkenntnisse über Logistik.</p>\n\n<p><strong>Deine Basis</strong></p>\n\n<ul>\n<li><p>Du verfügst über Informatikkenntnisse, insbesondere ist Erfahrung mit Javascript (ES6/ES7) oder PHP ( Je nach Aufgabenbereich ) wünschenswert. Ein klarer Bonus ist Erfahrung mit Frontend Frameworks á la React / Angular / Ember.</p></li>\n<li><p>Weiterentwicklung, Wissensdurst und der Austausch mit Experten und Profis sind bei Dir Grundbedürfnisse.</p></li>\n<li><p>Du kannst aber auch einfach mal im Support und der Unterstützung unserer Kunden vor Ort mithelfen und Dich dabei gut fühlen.</p></li>\n<li><p>Du sprichst perfektes Deutsch und besitzt gute Englischkenntnisse? Dann melde Dich so schnell als möglich. Wir wollen Dich kennen lernen!</p></li>\n</ul><p><strong>Du gefällst uns – das kriegst schon mal vorweg!</strong></p>\n\n<ul>\n<li>Arbeitszeit – wie Du willst. Na ja, Abstimmung mit dem Team wäre von Vorteil </li>\n<li>Arbeitsplatz- ob Pool, Wald oder Wohnung, Du bestimmst von wo Du arbeitest </li>\n<li>Erreichbarkeit – na bei soviel Freiheit müssen wir Dich halt irgendwie erreichen </li>\n<li>Tauschmittel – ordentlich, doch je produktiver Du wirst desto mehr drücken wir ab</li>\n</ul><p><strong>Interessiert? Dann sende Deine Bewerbung an: <a href=\"mailto:jobs@1st-log.com\">jobs@1st-log.com</a></strong></p>\n\n<p>1st Log AG\nIndustriestrasse 47 \nCH-6300 Zug \n<a href=\"https://www.1st-log.com\">https://www.1st-log.com</a></p>",
    "how_to_apply": "<p><a href=\"mailto:jobs@1st-log.com\">jobs@1st-log.com</a></p>",
    "company": "1st Log AG",
    "company_url": "https://www.1st-log.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/f9d16e34-0a7a-11e8-9edf-8b545c0ce9ff.png",
    "url": "http://jobs.github.com/positions/73ea3f84-0a7b-11e8-96d3-71d637f7d42a"
  },
  {
    "id": "ea4525b0-0ab0-11e8-9519-95ecaf4f4223",
    "created_at": "Mon Feb 05 20:12:59 UTC 2018",
    "title": "Senior Ruby on Rails Developer",
    "location": "Remote/US-based",
    "type": "Full Time",
    "description": "<p>FlexJobs is hiring! Since 2007, our awesome team has been working hard to present professional, legitimate, flexible jobs to our subscribers. In the bigger picture, we aim to make the job search experience a little easier and safer through hand-screened jobs, skills testing, and a blog that explores all areas of flexible working. </p>\n\n<p>Our mission is to improve the future of work by helping people find flexible jobs that make their lives better.  We are committed to doing this internally and externally with integrity, intelligence, balance, communication, and care.</p>\n\n<p>We also walk the talk! Our entire team works remotely from locations all across the United States. The ability to flex our schedules as needed to best fit our lives allows us to work in a very focused and productive way. The teams at FlexJobs collaborate and communicate as needed -- whether that’s several times a day or a couple of times a week -- to stay connected and engaged with one another.</p>\n\n<p><strong>Skills &amp; Experience Required</strong>\nRuby on Rails, remote development, Javascript, HTML5, CSS, Bootstrap, XML, jQuery, git</p>\n\n<p><strong>You must be based in the United States</strong></p>\n\n<p>More specifically, our ideal candidates will have:</p>\n\n<ul>\n<li>5+ years Ruby on Rails development experience - we are using version 5 </li>\n<li>10+ years object-oriented, web software development</li>\n<li>Experience with client-side development technologies including  HTML5, CSS, JQuery, Javascript, AJAX, JSON</li>\n<li>Responsive web page development experience utilizing Bootstrap</li>\n<li>Experience with frameworks like Angular 5 a plus</li>\n<li>Experience with PHP and maintaining Wordpress blog sites a plus</li>\n<li>Experience building and maintaining high volume, consumer-facing websites -- bonus points if you’ve worked on subscription-based sites</li>\n<li>Experience with automated testing suites</li>\n</ul><p><strong>Traits Required</strong></p>\n\n<ul>\n<li>Be interested in a full-time, long-term position</li>\n<li>Be comfortable working independently and in small teams</li>\n<li>Have a sense of pride in your work and a passion for coding</li>\n<li>Have a streak of perfectionism when it comes to details</li>\n<li>Be highly organized, responsible, and ethical</li>\n<li>Be proactive when it comes to asking questions, brainstorming, and working with colleagues</li>\n</ul><p><strong>Other Requirements</strong></p>\n\n<ul>\n<li>You must have a reliable development environment including: high-speed Internet access, a fast computer, and phone access</li>\n<li>Your work environment must be one in which you can really focus without distractions</li>\n</ul>",
    "how_to_apply": "<p>If this sounds a lot like you, then please consider applying! What we’ll need from you:</p>\n\n<ul>\n<li>1. An intro email/cover letter telling us why you are the right developer for FlexJobs - don't forget to tell us about your remote work experience</li>\n<li>2. A current resume in .doc, .docx, .pdf, markdown, or .txt</li>\n<li>3. Applications can be sent through FlexJobs or by email to <a href=\"mailto:jobs@flexjobs.com\">jobs@flexjobs.com</a>\n</li>\n</ul>",
    "company": "FlexJobs",
    "company_url": "http://www.flexjobs.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/11e40dc0-0ab1-11e8-8e43-9f2a564d2a96.png",
    "url": "http://jobs.github.com/positions/ea4525b0-0ab0-11e8-9519-95ecaf4f4223"
  },
  {
    "id": "e1ecf82c-0aa9-11e8-965b-ab28c74d9bd4",
    "created_at": "Mon Feb 05 19:23:18 UTC 2018",
    "title": "Web Designer/Developer",
    "location": "Tampa, FL",
    "type": "Full Time",
    "description": "<p>General Summary\nIf you’re looking to take the next step in your career as a web designer and developer, have the experience and skill-set listed below, and are driven by a passion to do great work, help contribute to the goals of an organization, and embrace the use of technology, development, and design as a strategic advantage, we want to hear from you.</p>\n\n<p>The Web Designer/Developer designs, develops, deploys, and maintains the organizations website to create an interactive and amazing user experience for our target audience. The sky is the limit on the opportunities this position will have to exercise your existing knowledge and skill set and continue to expand and grow your skills as we expand our digital strategy. This position manages the day-to-day activities related to the website and is involved with the short- and long-term content goals of the organization.  The ideal candidate will have a strong understanding of industry trends, open-source CMS knowledge, effective communication skills with both internal and external stakeholders, be confident and self-motivated, provide solutions to assist in advancing the organizations goals of the website, willing to learn and stay abreast of technology and best practices, and be adaptable to changing priorities and initiatives.  This position will interact with multiple departments throughout the company to create an engaging user experience on the web that speaks to visitors world-wide.  If you're wanting to be the lone, genius web designer/developer wanting to sit in a dark room, do your own thing, crunch code, take orders and not be bothered by internal clients, this position is not the right fit.</p>\n\n<p>Principal Duties and Responsibilities:</p>\n\n<ul>\n<li>Act as key point of contact for day-to-day operation of the company website utilizing Drupal \nCMS</li>\n<li>Develop, implement, and maintain Drupal core modules, views, panels, block, custom modules, etc. to customize site behavior to achieve desired results</li>\n<li>Utilize developer skills to troubleshoot any issues that may arise and provide innovative solutions to problems that cannot be solved out of the box</li>\n<li>Provide thorough testing and quality assurance to all work rendered including testing web pages for appearance, functionality, and responsiveness in multiple browsers</li>\n<li>Cleary work and communicate with third party vendor to troubleshoot functionality issues and future development projects within CMS </li>\n<li>Develop and make ongoing recommendations to improve the site, whether it be with navigation, content, enhancement, functionality, or other means so the site is visually appealing, easy to read, and navigate</li>\n<li>Test site for usability on an on-going basis (i.e. form submissions correctly going through lead admin, assets download properly, page URLs not broken, etc.)</li>\n<li>Review and ensure all content changes made to the website by you and the content mangers follows brand standards and best practices</li>\n<li>Work with stakeholders and content owners within the organization to understand business requirements to keep content and imagery on the website fresh and relevant for the best user experience</li>\n<li>Assist in developing and documenting content management system standards, guidelines, and processes for online content which are consistent with our brand guidelines</li>\n<li>Apply critical thinking skills to 'interpret' content and present it in a way that makes sense to users</li>\n<li>Assist in developing content strategy aligned with short-term and long-term marketing goals</li>\n<li>Advise content owners to determine which/how much content is appropriate and best format for content (e.g., HTML page, plain PDF or page-turner PDF) in terms of user experience, findability, SEO, etc.</li>\n<li>Ensure best practices are adhered to within the content, including but not limited to internal links, optimized headings, proper formatting and tagging of photography and graphics, etc.</li>\n<li>Develop customized landing pages to be used in paid advertising efforts </li>\n<li>Develop original website design ideas, within the predetermined template, that bring simplicity and user friendliness to complex roadblocks</li>\n<li>Prepare wireframes, storyboards, user flows, process flows and site maps as needed</li>\n<li>Maintain a consistent look and feel throughout website</li>\n<li>Stay abreast of trends in web design, coding, functionality, etc. to ensure we are adhering to web best practices and implementing technology as needed</li>\n</ul><p>Requirements &amp; Qualifications:</p>\n\n<ul>\n<li>3+ years of core experience with configuration, administration, design, development, and management of a website, using Drupal, or similar open source CMS and LAMP (Linux, Apache, MySQL, PHP) stack </li>\n<li>Expert knowledge of HTML5, CSS3, Javascript (jQuery), ANGULAR JS1.x, PHP, MySQL db integration, SQL database infrastructure, and Git</li>\n<li>Advanced knowledge of SASS/SCSS</li>\n<li>Intermediate experience with implementing Drupal core modules, views, panels, blocks, etc. and developing custom Drupal modules </li>\n<li>Strong full stack development knowledge</li>\n<li>Expert user interface design skills </li>\n<li>Ability to create compelling and innovative web pages and landing pages while working within the constraints of a template system</li>\n<li>Advanced knowledge of best practices for web design and web usability</li>\n<li>Ability to work well independently and collaboratively in a team environment </li>\n<li>Exceptional stakeholder management</li>\n<li>Strong organizational and time management skills including the ability to plan, prioritize workloads, balance multiple concurrent projects and work well under the pressure of tight deadlines and changing demands</li>\n<li>Must be extremely detail oriented with a high degree of accuracy</li>\n<li>Familiarity with design tools such as Photoshop, Illustrator, etc.</li>\n<li>Understanding of digital marketing including basic SEO and PPC</li>\n<li>Ability to review headlines and overall content for style consistency</li>\n<li>BA/BS with specialization in web design and development preferred or relevant work experience</li>\n<li>Portfolio of verifiable work on website of similar scope and complexity </li>\n<li>Experience with international sites, a plus</li>\n<li>Familiarity with email marketing software, a plus</li>\n<li>Knowledge of Google Analytics and data driven design, a plus\nAdditional Skills for Success:</li>\n<li>Strong communication skills</li>\n<li>A positive attitude</li>\n<li>Enthusiastic and willing to learn</li>\n<li>Confident and self-motivated with a strong work ethic</li>\n<li>A people person who is excellent at working with other people, teams, and building relationships</li>\n<li>A problem solver – keen to understand customer needs and offer solutions</li>\n</ul>",
    "how_to_apply": "<p>Email resume and salary requirements to: <a href=\"mailto:wperez@ispe.org\">wperez@ispe.org</a></p>",
    "company": "ISPE",
    "company_url": "http://ISPE",
    "company_logo": "http://github-jobs.s3.amazonaws.com/d89661e6-0aa9-11e8-9dd5-2eba2c4360ef.jpg",
    "url": "http://jobs.github.com/positions/e1ecf82c-0aa9-11e8-965b-ab28c74d9bd4"
  },
  {
    "id": "b4de5f62-0520-11e8-8853-f946cd8a523c",
    "created_at": "Mon Jan 29 18:24:41 UTC 2018",
    "title": "Web Application Developer",
    "location": "Chesapeake, VA, other",
    "type": "Full Time",
    "description": "<p>Emprise Corporation, with offices located in Ledyard, CT and Chesapeake, VA, provides condition monitoring services, software development, and software support for clients worldwide. Major customers include the U.S. Military Sealift Command, Covanta Energy, American Styrenics, Crowley Marine, Keystone Shipping Great Lakes Fleet, and Groton Utilities.  Our present initiatives include Database configuration software development.  Network reconfiguration to support centralized data storage and mining.  Oil analysis software modernization.  Personal digital vibration analyzer.  Thermography equipment modernization and Vibration analysis software modernization.</p>\n\n<p>Emprise is a growing company with employment opportunities in both locations. Our Employees enjoy a casual work environment, excellent pay and benefits.  Please see our website <a href=\"http://www.emprisecorporation.com\">www.emprisecorporation.com</a> for more information or Email your resume and links to your portfolio, GitHub, or other public profiles to <a href=\"mailto:jobs@emprisecorporation.com\">jobs@emprisecorporation.com</a>  </p>\n\n<p>Required:</p>\n\n<ul>\n<li>  Bachelor’s degree in Computer Science or equivalent years’ experience in Applications environment</li>\n<li>  Expert-level knowledge and experience of JavaScript.</li>\n<li>  Intermediate to expert-level knowledge and experience with HTML, CSS.</li>\n<li>  Familiarity with AngularJS, Git/GitHub, npm or Yarn, SCSS.</li>\n<li>  Comfortable with text-based communication like IM, chat, and email.</li>\n<li>  Experience supporting IE10+, Firefox, and Chrome.</li>\n<li>  Expertise with Java and/or C#</li>\n</ul><p>Desired:</p>\n\n<ul>\n<li>  Experience with Java, Spring, JDBC, Apache Tomcat or similar languages/tools.</li>\n<li>  Experience with Eclipse, or maven/gradle.</li>\n<li>  Experience with Lodash.</li>\n<li>  Familiarity with a development pipeline, like Webpack/rollup/TypeScript, gulp, etc.</li>\n<li>  Familiarity with automated testing Mocha, Karma, TestNG.</li>\n<li>  Familiarity with alternative libraries like React, VueJS, Angular (v2+), etc.</li>\n<li>  Familiarity with an Agile workflow.</li>\n<li>  Familiarity with continuous integration tools.</li>\n</ul><p>Position Objectives:   Turning feature requests into reality. Researching and resolving issues. Working to improve the quality of the application and the team. Much of the work is done on an AngularJS (v1.x) web application, and will be in JavaScript (ES6/2015+), HTML, CSS/SCSS, with light Java.</p>",
    "how_to_apply": "<p>Email your resume and links to your portfolio, GitHub, or other public profiles to <a href=\"mailto:jobs@emprisecorporation.com\">jobs@emprisecorporation.com</a></p>",
    "company": "Emprise Corporation",
    "company_url": "http://www.emprisecorporation.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/a7f613ee-0520-11e8-8f23-86587a1efb13.png",
    "url": "http://jobs.github.com/positions/b4de5f62-0520-11e8-8853-f946cd8a523c"
  },
  {
    "id": "17e23ac8-01ef-11e8-8dae-3c6ffa1df26e",
    "created_at": "Thu Jan 25 16:45:04 UTC 2018",
    "title": "Sr. Java Software Engineer - Apple Customer Systems",
    "location": "Cupertino, CA",
    "type": "Full Time",
    "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>Do you love designing &amp; architecting highly scalable applications? Does the idea of performance tuning Java applications make your heart leap? Would you like to work in a fast-paced environment where your technical abilities will be challenged on a day to day basis? Would you enjoy exploring new technologies?</p>\n\n<p>Apple Customer Systems Team is looking for a highly motivated, detail-oriented, energetic individual with excellent communication skills who is not afraid to think outside the box and question assumptions. In this role, you will be part of a fast growing, cohesive team with many exciting responsibilities related to n-tier application development.</p>\n\n<p>Key Qualifications:  </p>\n\n<ul>\n<li>Hands-on expertise in Java and Java enterprise technology applications architecture, design, development and support</li>\n<li>Strong knowledge of concurrency, scalability and fault tolerant designs</li>\n<li>NoSQL database experience, particularly with MongoDB</li>\n<li>Able to analyze business requirements and create efficient solutions</li>\n<li>Must be able to brainstorm and communicate technology ideas and issues with peers and IT management</li>\n<li>Excellent problem solving, critical thinking and communication skills</li>\n<li>Must be able to clearly define solutions for requirements and evaluate options</li>\n<li>Solid knowledge of applications performance improvement techniques and caching solutions</li>\n<li>Agile development experience is a plus</li>\n<li>Core skill: Java/J2EE</li>\n</ul><p>Description:\nLead design, development, implementation and maintenance of java applications &amp; back-end services demonstrating service-oriented architecture and secure applications development technology best practices\nWork with project managers and technical teams in a cross-functional environment, to implement quality products that meet business goals\nKeep up-to date on latest Java/J2EE solutions to generate innovative ideas to solve business challenges</p>\n\n<p>Education:\nBA/BS in Computer Science or related field with 7+ years of overall experience</p>\n\n<p>Additional Requirements:\nStrong Plus: Experience with Angular 2, ReactJS or VueJS\nStrong Plus: Experience with Java backend MVC frameworks such as Spring\nStrong Plus: Spark, Kafka, Hadoop etc.,\nScripting Languages: Python</p>\n\n<p>Apple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.</p>\n\n<p>REQUISITION NUMBER: 113408843\nCOMPANY NAME: Apple Inc.</p>",
    "how_to_apply": "<p><a href=\"https://ars2.equest.com/?response_id=8cbfae954ccd4df40afb746180a94fb2\">APPLY HERE</a></p>",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/a2e371d8-01ee-11e8-9847-16a4c947afc6.jpeg",
    "url": "http://jobs.github.com/positions/17e23ac8-01ef-11e8-8dae-3c6ffa1df26e"
  },
  {
    "id": "58df5800-0080-11e8-943a-56c675716f17",
    "created_at": "Tue Jan 23 21:00:44 UTC 2018",
    "title": "Sr. Software Engineer",
    "location": "San Ramon, CA",
    "type": "Full Time",
    "description": "<p>Sr. Software Engineer</p>\n\n<p>We are looking for a talented and entrepreneurially minded Sr. Software Engineer to join our high performing team and work with the latest technologies! You will be engaged throughout the full life cycle of the product including architecting, developing, documenting, troubleshooting, supporting, bug fixing, and more. </p>\n\n<p>The ideal candidate will have experience developing a product in a microservice architecture using Node.js and TypeScript on the server side. This API will be accessed from an Angular client, smart phone apps, and various other systems. Our engineers can work on any or all of these pieces as needed which is a constant opportunity for learning. </p>\n\n<p>We need software engineers that: </p>\n\n<ul>\n<li>Have hands on experience working with large web applications </li>\n<li>Know the value of modularity and keeping it simple </li>\n<li>Use object oriented programming practices </li>\n<li>Feel comfortable with relational databases </li>\n<li>Love working as part of a strong team </li>\n<li>Want to keep up on the latest technologies and drive innovation </li>\n<li>Enjoy working in an interactive, agile environment </li>\n</ul><p>Useful Experience: </p>\n\n<ul>\n<li>Microservice Architecture </li>\n<li>Node.js </li>\n<li>Angular </li>\n<li>Docker </li>\n<li>AWS </li>\n<li>SCRUM </li>\n<li>Typescript, C#, Java </li>\n<li>SQL </li>\n<li>ORM </li>\n</ul><p>Typically we find it takes a college degree plus 5 or more years of experience to get all this dialed in but, if you feel like you have what we need, don’t let that hold you back. </p>\n\n<p>We are unable to provide or transfer sponsorship at this time.</p>",
    "how_to_apply": "<p>To apply please email your resume, GitHub or website to <a href=\"mailto:jkuemmel@pscu.com\">jkuemmel@pscu.com</a> with the subject “Sr. Software Engineer”.</p>",
    "company": "PSCU",
    "company_url": "http://www.pscu.com",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/58df5800-0080-11e8-943a-56c675716f17"
  },
  {
    "id": "ceeff638-0078-11e8-85d1-92da8522ea65",
    "created_at": "Tue Jan 23 20:07:04 UTC 2018",
    "title": "Node.js Developer",
    "location": "Boca Raton, FL",
    "type": "Full Time",
    "description": "<p>Node.js Developer # 1116</p>\n\n<p>Position Summary:</p>\n\n<p>We are seeking a creative and talented engineer to provide technical expertise in software design and development. The successful candidate will have a proven track record for creating efficient, scalable, and manageable enterprise-level systems using open source technologies (Node.js, MySQL, MongoDB, Linux) hosted on AWS. You will be expected to be self-driven, think outside the box, and open to working in a fast paced startup environment with tight deadlines.</p>\n\n<p>Experience and Education:</p>\n\n<p>Bachelor’s degree in Computer Science or equivalent experience\n4+ years experience building large-scale server applications using a micro service based architecture\n4+ years experience working on high volume websites\nA deep, abiding love for building scalable, high performance systems</p>\n\n<p>Technology Skills and Strengths:</p>\n\n<p>Strong proficiency with Node.js\nHTML5, CSS3\nWeb Services (SOAP and/or REST)\nCloud Development(AWS or similar)\nMongo DB, MySql DB\nDocker\nMicroservices\nContinuous Integration tools\nAgile methodologies\nProficient understanding of code versioning tools such as Git\nCreating database schemas that represent and support business processes\nExpert-level understanding of the systems development life cycle\nExperience with caching high traffic sites and microservices\nAngular JS a plus\nHighly adept at innovating and thinking beyond established standards and processes\nDemonstrated organizational, analytical and interpersonal skills\nFlexible team player\nAbility to manage tasks independently without close supervision and take ownership of responsibilities\nExpert-level ability to communicate highly complex technical information clearly and articulately at all levels and audiences\nAbility to adapt to a rapidly changing environment\nComfortable with a fast paced start up environment and tight deadlines</p>\n\n<p>Primary Job Responsibilities:</p>\n\n<p>Build out features across the entire development stack\nDrive new features as well as maintain existing code\nUnderstand the business well enough to align your development with company goals\nCreate and share dev best practices and standards. Always be learning\nCollaborate on the design of new build outs and write tests to maximize efficiency\nPerform code reviews to ensure best practices are being employed</p>",
    "how_to_apply": "<p>please send your resume to <a href=\"mailto:RecruitingCoordinator@rangertech.com\">RecruitingCoordinator@rangertech.com</a> and reference this GitHub Node.JS role!</p>",
    "company": "Ranger Technical Resources",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/03f42df6-0077-11e8-984b-4b784e0216bf.png",
    "url": "http://jobs.github.com/positions/ceeff638-0078-11e8-85d1-92da8522ea65"
  },
  {
    "id": "b20dc1da-ff79-11e7-876e-aeca2bee170c",
    "created_at": "Mon Jan 22 13:41:50 UTC 2018",
    "title": "Hybris Developer",
    "location": "Eindhoven",
    "type": "Full Time",
    "description": "<p><strong>With its solidly-grounded commerce skills and technical knowledge, Elision is a trusted advisor for building high-end commerce trade channels.</strong><br><br>\nElision delivers solutions that guarantee a consistent interaction over all channels and touchpoints. We create value by means of a comprehensive package of services, from digital strategy consulting and service design to development and managed services. This makes Elision the partner for companies accompanying them in their digital transformation.<br><br>\nElision is an innovative player and offers the best possible solution within the SAP Customer Engagement and Commerce landscape: hybris commerce, hybris marketing and C4C.<br><br>\nElision is part of the Xplore group (Cronos).<br><br>\nAs our growth continues, we are looking for experienced Hybris developers to join our teams for projects in the Netherlands!<br><br><strong>YOUR POSITION</strong><br>\nWorking in a team on the development of high-end e-commerce applications for global brands, B2B contexts and general Omni-channel digitalisation projects. You are a technical expert in SAP Hybris and closely follow developments in the field of Java development, focussing on back-end or front-end (or both).<br><br><strong>WHO ARE YOU?</strong><br>\nYou have 5 years off relevant consulting or industry experience and at least 3+ years' experience in implementing the Hybris platform (5.x and 6.x). A Strong background in Java/Spring environments and hands-on development experience, as well as a good knowledge of object-oriented principles, design patterns, database design and data modelling is required. You're familiar with front-end ( HTML, CSS, Bootstrap, Angular, React , ... ) and back-end Java-based frameworks.<br><br><em>\"Great things in business are never done by one person, they are done by a team of people.\" Steve Jobs</em><br></p>\n\n<ul>\n<li>You are a real team player</li>\n<li>You have experience in agile development</li>\n<li>In all of this you are customer oriented and you strive to get the job done</li>\n<li>Communication is essential as you are working together with clients and a team of developers, architects, analysts, project managers and other</li>\n<li>You preferably obtained a bachelor or a master's degree</li>\n<li>Besides Dutch you also possess a good knowledge of English</li>\n</ul><p><strong>WE OFFER YOU</strong></p>\n\n<ul>\n<li>A permanent position in a young team, with room for creativity, initiative and growth</li>\n<li>A pleasant working environment in a traffic jam-free location</li>\n<li>An opportunity for growth and learn from the experts in the business</li>\n<li>Trainings and events on a regular base</li>\n</ul><p><strong>INTERESTED?</strong><br>\nPlease apply using the <strong>link</strong> on the right side.<br><br><em>Keywords: Vacancy, full-time, Eindhoven, development, front-end, Hybris.</em></p>",
    "how_to_apply": "<p><a href=\"https://elision.redirect.your-jobresponse.com/hybris_developer_eindhoven/187213/V819/apply\">Click here to apply online!</a></p>",
    "company": "Elision",
    "company_url": "https://elision.redirect.your-jobresponse.com/h/187213/V819/apply",
    "company_logo": "http://github-jobs.s3.amazonaws.com/9b30fdce-ff79-11e7-92fb-6f454c0e16d6.png",
    "url": "http://jobs.github.com/positions/b20dc1da-ff79-11e7-876e-aeca2bee170c"
  },
  {
    "id": "3afa0270-fd6c-11e7-8225-a795ad2d2efb",
    "created_at": "Fri Jan 19 22:59:50 UTC 2018",
    "title": "Full Stack Platform Developer",
    "location": "San Francisco",
    "type": "Full Time",
    "description": "<p><b>Who we are:</b></p>\n\n<p>Panoply is set out to revolutionize the world of advanced data management, making it easy and fun to digest hundreds of different data sources, in real-time and petabyte-scale. The developers at Panoply are working on building a cutting-edge platform that can absorb massive amounts of data, in minutes, and provide users with an engaging experience for loading, transforming and exploring their data. </p>\n\n<p><b>You will:</b></p>\n\n<ul>\n<li>Lead the design and architecture of the data processing pipeline and the core query engine, as \n   well as build developer tools &amp; APIs.</li>\n<li>Collaborate with a team of developers and customers to prototype, design, and build creative \n   user-facing products.</li>\n<li>Build integration code with many cutting-edge technologies and processes, including Python 3, \n   Go, Presto, AWS, ML, NLP.</li>\n</ul><p><b>You'll need:</b></p>\n\n<ul>\n<li>Passion about technology • Drive to be the best • Awesome startup attitude</li>\n<li>3-5 years of experience in one or more of the following technologies: Go, Python, \n   Javascript/Node.js, Ruby</li>\n<li>Comprehensive expertise in Object Oriented Design, Software Architecture, Algorithms &amp; Data \n   Structures</li>\n<li>Experience or contribution to high-profile open-source projects</li>\n<li>Experience with Linux and Web-related technologies, AWS, Database Design</li>\n<li>Advantage: Experience in massive-scale data processing, using Redshift, Hadoop, Spark, EMR, \n   Google BigQuery</li>\n<li>Advantage: Experience in cutting-edge client-side technologies like HTML5, Web Components, \n   Dart, Less/Sass, D3, Angular</li>\n<li>Previous client facing experience and perfect communication skills</li>\n</ul><p><b>More about Panoply:</b></p>\n\n<p>Panoply is the world’s only ETL-less smart data warehouse. Built for the cloud, Panoply delivers the industry’s fastest time to insights by eliminating the development and coding typically associated with transforming, integrating, and managing big data. Panoply’s proprietary machine learning and natural language processing algorithms automatically enrich, transform and optimize big data, making it simple to gain actionable insights. </p>\n\n<p>Generous benefits package, free food, and unlimited coffee.</p>",
    "how_to_apply": "<p><a href=\"https://panoply.io/careers/full-stack-platform-developer/\">https://panoply.io/careers/full-stack-platform-developer/</a></p>",
    "company": "Panoply",
    "company_url": "http://panoply.io",
    "company_logo": "http://github-jobs.s3.amazonaws.com/d99b057a-fd6a-11e7-9f75-07e1b0f93271.jpg",
    "url": "http://jobs.github.com/positions/3afa0270-fd6c-11e7-8225-a795ad2d2efb"
  },
  {
    "id": "01cb1f38-fab1-11e7-8f8b-2280e19fe166",
    "created_at": "Tue Jan 16 11:34:07 UTC 2018",
    "title": "Collaboration Software Developer (Java)",
    "location": "Houten",
    "type": "Full Time",
    "description": "<p><b>Java Angular Node.JS \nWatson Bluemix Connections </b></p>\n\n<p>Als Software developer werk je aan verschillende projecten (solo en team) gerelateerd aan kunstmatige intelligentie, ongestructureerde data, en samenwerkingssoftware binnen het IBM portfolio (Connections, Watson en Bluemix). Je werkt in ons professionele clubhuis of bij een klant op locatie. In het ene project verken je technologie en/of oplossingen en in andere projecten vertaal functionele klantwensen naar een technisch ontwerp. Ook adviseer je onze klanten over de inzet van diverse IBM producten en het gebruik van open standaarden en de mogelijkheden hiervan. </p>\n\n<p>Vaak zul je werken met de standaarden Java, node.JS, Angular en/of MongoDB. Mooi is dat je bij e-office vrij bent om ook met andere technologieën te werken, mits het past in het totale plaatje van de klant of oplossing. </p>\n\n<p><b>Wie ben jij?</b><br>\nTen eerste wordt jij enthousiast van onze visie en je weet dat jij zal bloeien in een omgeving met zo veel vrijheid, verantwoordelijkheid en mogelijkheden. Je acteert op HBO/WO werk- en denkniveau en werkt graag in projecten. Je communiceert makkelijk in de Nederlandse taal, bent gedreven en ambitieus. Je vindt het een uitdaging om zelfstandig requirements uit te vragen, problemen op te lossen en oplossingen te bouwen.</p>\n\n<p>Als Software Developer heb je minimaal zo’n 2 jaar professionele ervaring met software ontwikkeling. Je hebt al gewerkt of minimaal gekeken naar de mogelijkheden van Java en/of Node.js. Mooie bijkomstigheid is als je al in aanraking bent geweest met DevOps tools zoals Jenkins en Docker. </p>\n\n<p>Uiteraard kan en mag je ook in aanraking komen met andere innovatieve technologieën binnen de IBM Connections Suite (of zelfs van de Modern Workplace van Micrososft).).</p>\n\n<p><b>Aanbod</b>\nAls je het inhoudelijk en persoonlijk beste uit jezelf wilt halen kan e-office heel erg interessant voor je zijn. Er is veel (technologische) vrijheid en je krijgt veel verantwoordelijkheid. Eigen initiatief wordt zeer gewaardeerd. </p>\n\n<p>Als Software Developer ga je aan de slag met innovatieve oplossingen voor onze klanten, deze oplossingen kunnen een cloud, artificial intelligence (A.I.), Internet of Things, en samenwerkingscomponent hebben. We betalen een goed salaris met prima secundaire arbeidsvoorwaarden, zoals bijvoorbeeld 29 vakantiedagen en een lease auto of een goede reiskostenvergoeding. Het prettige kantoor in Houten heeft allerlei voorzieningen zoals bijvoorbeeld een gezamenlijk biologische lunch.</p>\n\n<p>De balans tussen werk en privé vinden wij uitermate belangrijk en dit ondersteunen we met flexibele werktijden en de modernste samenwerkingssoftware, een laptop en een telefoon van de zaak. </p>\n\n<p><b>e-office</b><br>\nWil je als organisatie of als medewerker goed om kunnen gaan met een steeds complexere wereld, dan biedt <a href=\"http://www.e-office.com\" target=\"_blank\">e-office</a> je andere manieren van werken en samenwerken. We doen dit met name met cloud technologie van IBM(Watson, Bluemix en Connections) en Microsoft (Azure, Office365 en Dynamics365). Concreet én innovatief. Samen met <a href=\"http://www.work21.nl\" target=\"_blank\">work21</a> en <a href=\"http://www.blaud.com\" target=\"_blank\">BLAUD</a>, die ons flankeren met veranderkracht en mobiele expertise.</p>\n\n<p>e-office group is in 1991 opgericht met ‘de kracht van mensen’ als uitgangspunt. Als voorbeeld in de markt zoekt e-office altijd naar nieuwe manieren van werken, samenwerken en organiseren. Uiteraard op het snijvlak van technologie, mens en organisatie.</p>",
    "how_to_apply": "<p><a href=\"https://content.e-office.com/acton/form/18844/006f:d-0001/0/-/-/-/-/index.htm\" target=\"_blank\">Reageer hier direct</a><br><br> Uiteraard kan je ook de <a href=\"https://www.e-office.com/vacatures/software-developer/\" target=\"_blank\">vacature op onze website</a> bekijken of contact opnemen met Marcel de Jong via <a href=\"mailto:marcel.de.jong@e-office.com?SUBJECT=software%20developer%20bij%20e-office\">e-mail</a> of <a href=\"https://api.whatsapp.com/send?phone=31642740652\" target=\"_blank\"> WhatsApp</a>.</p>",
    "company": "e-office",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/e8f8af96-faad-11e7-86ea-5784eb86bcd8.png",
    "url": "http://jobs.github.com/positions/01cb1f38-fab1-11e7-8f8b-2280e19fe166"
  },
  {
    "id": "6f3147fa-119f-11e8-858a-f6bea5c8462d",
    "created_at": "Wed Feb 14 15:57:41 UTC 2018",
    "title": "Hybris Developer",
    "location": "Eindhoven",
    "type": "Full Time",
    "description": "<p><b>With its solidly-grounded commerce skills and technical knowledge, Elision is a trusted advisor for building high-end commerce trade channels.&lt;.b&gt;</b></p>\n\n<p>Elision delivers solutions that guarantee a consistent interaction over all channels and touchpoints. We create value by means of a comprehensive package of services, from digital strategy consulting and service design to development and managed services. This makes Elision the partner for companies accompanying them in their digital transformation.</p>\n\n<p>Elision is an innovative player and offers the best possible solution within the SAP Customer Engagement and Commerce landscape: hybris commerce, hybris marketing and C4C.</p>\n\n<p>Elision is part of the Xplore group (Cronos).</p>\n\n<p>As our growth continues, we are looking for experienced Hybris developers to join our teams for projects in the Netherlands!</p>\n\n<p><b>YOUR POSITION</b><br>\nWorking in a team on the development of high-end e-commerce applications for global brands, B2B contexts and general Omni-channel digitalisation projects. You are a technical expert in SAP Hybris and closely follow developments in the field of Java development, focussing on back-end or front-end (or both).</p>\n\n<p><b>WHO ARE YOU?</b><br>\nYou have 5 years off relevant consulting or industry experience and at least 3+ years' experience in implementing the Hybris platform (5.x and 6.x). A Strong background in Java/Spring environments and hands-on development experience, as well as a good knowledge of object-oriented principles, design patterns, database design and data modelling is required. You're familiar with front-end ( HTML, CSS, Bootstrap, Angular, React , ... ) and back-end Java-based frameworks.</p>\n\n<p><i>\"Great things in business are never done by one person, they are done by a team of people.\" Steve Jobs</i></p>\n\n<ul>\n<li>You are a real team player</li>\n<li>You have experience in agile development</li>\n<li>In all of this you are customer oriented and you strive to get the job done</li>\n<li>Communication is essential as you are working together with clients and a team of developers, architects, analysts, project managers and other</li>\n<li>You preferably obtained a bachelor or a master's degree</li>\n<li>Besides Dutch you also possess a good knowledge of English</li>\n</ul><p><b>WE OFFER YOU</b></p>\n\n<ul>\n<li>A permanent position in a young team, with room for creativity, initiative and growth</li>\n<li>A pleasant working environment in a traffic jam-free location</li>\n<li>An opportunity for growth and learn from the experts in the business</li>\n<li>Trainings and events on a regular base</li>\n</ul><p>INTERESTED?\nPlease apply using the application form.</p>\n\n<p><a href=\"https://elision.redirect.your-jobresponse.com/hybris_developer_eindhoven/187213/V819/apply\">Click here for the application form!</a></p>\n\n<p><i> Keywords: Vacancy, full-time, Eindhoven, development, front-end, Hybris.</i></p>",
    "how_to_apply": "<p><a href=\"https://elision.redirect.your-jobresponse.com/hybris_developer_eindhoven/187213/V819/apply\">Click here for the application form!</a></p>",
    "company": "Elision",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/5514e0b6-119f-11e8-8821-9d5cdaeca1b1.png",
    "url": "http://jobs.github.com/positions/6f3147fa-119f-11e8-858a-f6bea5c8462d"
  },
  {
    "id": "df5c2d7e-10d2-11e8-8905-81f954c87efa",
    "created_at": "Tue Feb 13 15:32:12 UTC 2018",
    "title": "Senior Frontend Developer with Angular JS 2 (Homeoffice / Flexible)",
    "location": "Remote",
    "type": "Full Time",
    "description": "<p><strong>This is a full-time remote position, we accept applications from anywhere in the world.</strong></p>\n\n<p><strong>&gt;&gt; Check out <a href=\"https://jobs.digistore24.com/senior-front-end-developer/lp/\">our job video</a> and <a href=\"https://jobs.digistore24.com/en/jobs/\">our careers page</a> to see if we would be a good fit.&lt;&lt;</strong></p>\n\n<p><em>At Digistore24 we develop software that has an impact on thousands of small and medium sized businesses every day. If you are man of action who loves to work in a small, family-like team and who has the passion and work ethic to develop great software products, we are the right fit for you.</em></p>\n\n<p>We are one of the fastest growing software companies in Europe. Our core platform is an automation solution developed by a small and extremely competent team. It provides a complete infrastructure to over 100.000 entrepreneurs to build a scalable online business with millions of customers.</p>\n\n<p><strong>The Job</strong></p>\n\n<p>We are looking for an experienced front-end developer with high motivation, a keen interest in our business use case and a sense for good user experience and beautiful design. You should be very familiar with AngularJS 2 and have an uncompromising drive to design beautiful interfaces.</p>\n\n<p>It is also important to us that you have already created a complex web application, that you have experience in agile development processes, and that you consider first-class, clean, and easily testable code as the basis of your work. You should also bring with you:</p>\n\n<ul>\n<li>Proficient understanding of web markup, including HTML5, CSS3</li>\n<li>Good understanding of advanced JavaScript libraries and frameworks, such as AngularJS 2</li>\n<li>Min. 5 years of professional experience along with a proven track record of delivering complex web projects in a leading role</li>\n<li>Basic understanding of server-side CSS pre-processing platforms, such as LESS and SASS</li>\n<li>Ability to improve architecture and code quality by refactoring</li>\n<li>Basic knowledge of image authoring tools, to be able to crop, resize, or perform small adjustments on an image. (Familiarity with tools such as as Gimp or Photoshop is a plus)</li>\n<li>Proficient understanding of cross-browser compatibility issues and ways to work around them</li>\n<li>Experience with agile development methods\n+Good English language skills with German being an asset</li>\n</ul><p><strong>The Benefits</strong></p>\n\n<p>If you bring that to the table and identify with our culture, you are welcome as a valuable member of our team. We are looking for long-term relationships and we try to get you into the project that suits you the most.</p>\n\n<p>We give so that you can contribute. If that scares you off, very well - then you do not make a bad investment and either do we. If you like our approach, then we would be really happy to hear from you.</p>\n\n<p><strong>Your Application</strong></p>\n\n<p>We do not want to assess your skills and motivation solely based on diplomas and certificates. Show us what you did. We are interested in all projects of your previous occupations, own projects, your code on Github, etc.</p>\n\n<p>Please send your application <a href=\"https://jobs.digistore24.com/senior-front-end-developer/lp/\">via our jobs page</a> and upload your resume (PDF) as well as all the work samples you think are necessary.</p>\n\n<p>When everything goes well, we will get back to you and have a short phone call. The next steps will be:</p>\n\n<ul>\n<li>a code test</li>\n<li>an interview with our CEO and the tech team</li>\n<li>a final feedback and a job offer within 2 weeks time</li>\n</ul><p>If you have questions concerning this position, don’t hesitate to send an e-mail to <a href=\"mailto:jobs@digistore24.com\">jobs@digistore24.com</a></p>",
    "how_to_apply": "<p>Please use our form: <a href=\"https://jobs.digistore24.com/senior-front-end-developer/lp/\">https://jobs.digistore24.com/senior-front-end-developer/lp/</a></p>",
    "company": "Digistore24 GmbH",
    "company_url": "http://www.jobs.digistore24.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/d69e035e-10cf-11e8-9924-19672d8bafde.jpg",
    "url": "http://jobs.github.com/positions/df5c2d7e-10d2-11e8-8905-81f954c87efa"
  },
  {
    "id": "fd005bf2-0d99-11e8-9912-b23fd801887b",
    "created_at": "Fri Feb 09 13:06:36 UTC 2018",
    "title": "Development Warlock (fulltime, Munich)",
    "location": "Munich",
    "type": "Full Time",
    "description": "<p>You like to hack/dev/program/prototype? Join us! </p>\n\n<h3>Who we are</h3>\n\n<p>mantro is a company which specializes in… ah, c'mon, let`s just cut the crap, you can take a look at the website if you are interested in that. We are a very diverse, multi-cultural and fun team with expertise from a variety of areas. What we all share is a passion for creating kick-ass products together.</p>\n\n<h3>On the backend we use</h3>\n\n<ul>\n<li>Kotlin (Spring Boot)</li>\n<li>NodeJS</li>\n<li>100% No PHP</li>\n</ul><h3>On the frontend we use</h3>\n\n<ul>\n<li>React, React, React</li>\n<li>Redux or Mobx</li>\n<li>Sometimes Ember</li>\n<li>No Angular lately...</li>\n<li>SASS, SCSS, LESS, PostCSS</li>\n<li>Webpack</li>\n<li>Typescript, or Babel</li>\n</ul><h3>On mobile we use</h3>\n\n<ul>\n<li>React Native</li>\n<li>(.. pause ..)</li>\n<li>Swift (Objective-C to feel oldschool)</li>\n<li>Java</li>\n<li>Web-Technologies / Cordova / Phonegap</li>\n</ul><h3>To store data we use</h3>\n\n<ul>\n<li>Postgres</li>\n<li>InfluxDB</li>\n<li>S3</li>\n<li>sometimes MySQL</li>\n<li>sometimes Mongo</li>\n</ul><h3>To orchestrate we use</h3>\n\n<ul>\n<li>Docker (erm, what else)</li>\n<li>Docker Compose (locally)</li>\n<li>k8s (remote)</li>\n</ul><h3>CPU power is sponsored by</h3>\n\n<ul>\n<li>AWS</li>\n<li>Digital Ocean</li>\n<li>Sometimes Heroku</li>\n</ul><h3>To work we use</h3>\n\n<ul>\n<li>(insert your IDE here)</li>\n<li>(insert your OS here)</li>\n<li>git</li>\n</ul><h3>We favor</h3>\n\n<ul>\n<li>Single page applications over server * generated html (since 2012)</li>\n<li>JSON over XML</li>\n<li>React over Ember</li>\n<li>Ember over Angular</li>\n<li>Angular over... err... ... Well, actually we don't do Angular</li>\n<li>Webpack over Gulp</li>\n<li>Pragmatic over dogmatic</li>\n<li>Solutions over problems</li>\n<li>Slack over skype</li>\n<li>Beer over wine</li>\n<li>Beef over Salad (speaking average here)</li>\n</ul><h3>We provide (one of the bullet points is a lie)</h3>\n\n<ul>\n<li>a band room</li>\n<li>a kicker table</li>\n<li>a table tennis table</li>\n<li>basketball and WiFi on the toilet</li>\n<li>lots of bureaucracy</li>\n<li>a dart board</li>\n<li>shitloads of drinks</li>\n<li>all current (and past) consoles and AR/VR shenanigans</li>\n<li>very fast internet</li>\n</ul><p>Well, if you made it until here you probably realized that we want to talk to you.</p>\n\n<p>Via Skype. Or in person. With a coffee. Or a beer.</p>\n\n<p><a href=\"mailto:hello@mantro.net\">hello@mantro.net</a></p>",
    "how_to_apply": "<p><a href=\"mailto:hello@mantro.net\">hello@mantro.net</a></p>",
    "company": "mantro GmbH",
    "company_url": "https://mantro.net",
    "company_logo": "http://github-jobs.s3.amazonaws.com/e06d45d6-0d99-11e8-87f8-a8eac4f09071.png",
    "url": "http://jobs.github.com/positions/fd005bf2-0d99-11e8-9912-b23fd801887b"
  },
  {
    "id": "67845168-5dc8-11e7-9f09-ed28a3f1978b",
    "created_at": "Wed Feb 07 20:39:48 UTC 2018",
    "title": "Full Stack Engineer @ Genius",
    "location": "Brooklyn, NY",
    "type": "Full Time",
    "description": "<p>The Genius engineering team builds and maintains a website and apps that are used by 100 million people every month. The majority of the content—lyrics, annotations, and metadata—is crowdsourced by an engaged group of contributors using a complex and ever evolving technical platform.</p>\n\n<p><a href=\"http://genius.com\"><strong>Genius</strong></a> is looking for a <a href=\"https://hire.withgoogle.com/public/jobs/geniuscom/view/P_AAAAAACAAADM2i58JVfhyW?trackingTag=gitHub\"><strong>Full Stack Engineer</strong></a> to architect and implement new features. We’re looking for makers with a sophisticated code sense: folks who’ve built cool things, but who can also maintain and scale those things, and who feel at home deep in the guts of a library.</p>\n\n<p>The best candidates will have professional experience on a web stack serving millions of users, will be proficient with Ruby on Rails, MySQL or Postgres, and have some experience with a front-end javascript framework (Angular, React, Ember, etc).</p>\n\n<h3>Responsibilities</h3>\n\n<ul>\n<li>Build and maintain web application features, primarily with Rails</li>\n<li>Work closely with application infrastructure to scale backend services to tens of thousands of requests per minute</li>\n<li>Develop the APIs that our Android and iPhone apps and web frontend consume</li>\n<li>Create frontend interfaces with HTML, CSS, and Javascript (including Angular)</li>\n<li>Write PostgreSQL queries and migrations that scale to large tables with 50M+ rows</li>\n<li>Work closely with product team to define feature specifications</li>\n<li>On-call duty to respond to urgent bugs or outages</li>\n</ul><h3>Requirements:</h3>\n\n<ul>\n<li>Significant experience writing and deploying code on a large-scale production app</li>\n<li>Significant experience with Ruby on Rails</li>\n<li>Significant experience with at least one front end framework: Angular, Ember, React, or similar</li>\n<li>Significant experience working with relational databases and writing SQL queries</li>\n</ul><h3>Ideal requirements:</h3>\n\n<ul>\n<li>3+ years experience with Rails development</li>\n<li>3+ years experience with Angular</li>\n<li>3+ years experience with PostgreSQL/MySQL</li>\n</ul><h3>Example Projects</h3>\n\n<ul>\n<li>Design an activity stream scalable to 100M+ events and a filterable “firehose” interface for consuming them</li>\n<li>HTTP-cache all pages at the edge for logged-out users only</li>\n<li>Write Javascript that can run robustly in any other website’s JS and CSS environment</li>\n<li>Develop a system for anchoring annotations to arbitrary DOM that can change out from under you</li>\n<li>Calculate document ownership based on edit history with hundreds of distinct authors</li>\n<li>Develop representation for rich text that’s portable to native iOS and Android environments</li>\n<li>Create framework for caching partial templates</li>\n<li>Design a domain-specific language and implementation of site-wide rate limits for spammy or abusive behavior</li>\n<li>Fingerprint artist names to prevent duplicate data with low false-positive rate</li>\n</ul>",
    "how_to_apply": "<h2><a href=\"https://hire.withgoogle.com/public/jobs/geniuscom/view/P_AAAAAACAAADM2i58JVfhyW?trackingTag=gitHub\">&gt;&gt; Click here to apply! &lt;&lt;</a></h2>",
    "company": "Genius",
    "company_url": "http://genius.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/49c225b0-5dc8-11e7-9020-26f5fc587e9e.png",
    "url": "http://jobs.github.com/positions/67845168-5dc8-11e7-9f09-ed28a3f1978b"
  },
  {
    "id": "73ea3f84-0a7b-11e8-96d3-71d637f7d42a",
    "created_at": "Wed Feb 07 10:06:43 UTC 2018",
    "title": "Software Engineer (full remote)",
    "location": "Full Remote Job",
    "type": "Full Time",
    "description": "<p>Du bist ausgeschlafen, hast eine schnelle Auffassungsgabe und hoffentlich eine Portion Pioniergeist. 1st Log ist Start Up Unternehmen, dass aus leidenschaftlichen Mitarbeitern und starken Produkten besteht. Kaum gegründet konnten wir schon namhafte Kunden gewinnen und sie mit unserer Innovation begeistern.</p>\n\n<p><strong>Wir stehen auf Willkommensgeschenke – das bringst Du uns mit:</strong></p>\n\n<p>Power, Leidenschaft, Pioniergeist und Feuer für neue Technologien in der Softwareentwicklung. Als Web und App Entwickler arbeitest du in Projekten mit unserem innovativen Team für Grosskunden im Logistikbereich zusammen. Du erlebst, wenn Deine selbstständig erstellten Module «zu laufen» beginnen und sich Technik und Know How zu produktiven Lösungen vereinen. Herausfordernde Aufgaben löst du kompetent, ziel- und terminorientiert und hast dabei stets Perfektion, Prozesse, Synergien und passende Technik im Auge. Du lernst mit unserem Team agil und dynamisch neue Techniken und Fachkenntnisse über Logistik.</p>\n\n<p><strong>Deine Basis</strong></p>\n\n<ul>\n<li><p>Du verfügst über Informatikkenntnisse, insbesondere ist Erfahrung mit Javascript (ES6/ES7) oder PHP ( Je nach Aufgabenbereich ) wünschenswert. Ein klarer Bonus ist Erfahrung mit Frontend Frameworks á la React / Angular / Ember.</p></li>\n<li><p>Weiterentwicklung, Wissensdurst und der Austausch mit Experten und Profis sind bei Dir Grundbedürfnisse.</p></li>\n<li><p>Du kannst aber auch einfach mal im Support und der Unterstützung unserer Kunden vor Ort mithelfen und Dich dabei gut fühlen.</p></li>\n<li><p>Du sprichst perfektes Deutsch und besitzt gute Englischkenntnisse? Dann melde Dich so schnell als möglich. Wir wollen Dich kennen lernen!</p></li>\n</ul><p><strong>Du gefällst uns – das kriegst schon mal vorweg!</strong></p>\n\n<ul>\n<li>Arbeitszeit – wie Du willst. Na ja, Abstimmung mit dem Team wäre von Vorteil </li>\n<li>Arbeitsplatz- ob Pool, Wald oder Wohnung, Du bestimmst von wo Du arbeitest </li>\n<li>Erreichbarkeit – na bei soviel Freiheit müssen wir Dich halt irgendwie erreichen </li>\n<li>Tauschmittel – ordentlich, doch je produktiver Du wirst desto mehr drücken wir ab</li>\n</ul><p><strong>Interessiert? Dann sende Deine Bewerbung an: <a href=\"mailto:jobs@1st-log.com\">jobs@1st-log.com</a></strong></p>\n\n<p>1st Log AG\nIndustriestrasse 47 \nCH-6300 Zug \n<a href=\"https://www.1st-log.com\">https://www.1st-log.com</a></p>",
    "how_to_apply": "<p><a href=\"mailto:jobs@1st-log.com\">jobs@1st-log.com</a></p>",
    "company": "1st Log AG",
    "company_url": "https://www.1st-log.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/f9d16e34-0a7a-11e8-9edf-8b545c0ce9ff.png",
    "url": "http://jobs.github.com/positions/73ea3f84-0a7b-11e8-96d3-71d637f7d42a"
  },
  {
    "id": "ea4525b0-0ab0-11e8-9519-95ecaf4f4223",
    "created_at": "Mon Feb 05 20:12:59 UTC 2018",
    "title": "Senior Ruby on Rails Developer",
    "location": "Remote/US-based",
    "type": "Full Time",
    "description": "<p>FlexJobs is hiring! Since 2007, our awesome team has been working hard to present professional, legitimate, flexible jobs to our subscribers. In the bigger picture, we aim to make the job search experience a little easier and safer through hand-screened jobs, skills testing, and a blog that explores all areas of flexible working. </p>\n\n<p>Our mission is to improve the future of work by helping people find flexible jobs that make their lives better.  We are committed to doing this internally and externally with integrity, intelligence, balance, communication, and care.</p>\n\n<p>We also walk the talk! Our entire team works remotely from locations all across the United States. The ability to flex our schedules as needed to best fit our lives allows us to work in a very focused and productive way. The teams at FlexJobs collaborate and communicate as needed -- whether that’s several times a day or a couple of times a week -- to stay connected and engaged with one another.</p>\n\n<p><strong>Skills &amp; Experience Required</strong>\nRuby on Rails, remote development, Javascript, HTML5, CSS, Bootstrap, XML, jQuery, git</p>\n\n<p><strong>You must be based in the United States</strong></p>\n\n<p>More specifically, our ideal candidates will have:</p>\n\n<ul>\n<li>5+ years Ruby on Rails development experience - we are using version 5 </li>\n<li>10+ years object-oriented, web software development</li>\n<li>Experience with client-side development technologies including  HTML5, CSS, JQuery, Javascript, AJAX, JSON</li>\n<li>Responsive web page development experience utilizing Bootstrap</li>\n<li>Experience with frameworks like Angular 5 a plus</li>\n<li>Experience with PHP and maintaining Wordpress blog sites a plus</li>\n<li>Experience building and maintaining high volume, consumer-facing websites -- bonus points if you’ve worked on subscription-based sites</li>\n<li>Experience with automated testing suites</li>\n</ul><p><strong>Traits Required</strong></p>\n\n<ul>\n<li>Be interested in a full-time, long-term position</li>\n<li>Be comfortable working independently and in small teams</li>\n<li>Have a sense of pride in your work and a passion for coding</li>\n<li>Have a streak of perfectionism when it comes to details</li>\n<li>Be highly organized, responsible, and ethical</li>\n<li>Be proactive when it comes to asking questions, brainstorming, and working with colleagues</li>\n</ul><p><strong>Other Requirements</strong></p>\n\n<ul>\n<li>You must have a reliable development environment including: high-speed Internet access, a fast computer, and phone access</li>\n<li>Your work environment must be one in which you can really focus without distractions</li>\n</ul>",
    "how_to_apply": "<p>If this sounds a lot like you, then please consider applying! What we’ll need from you:</p>\n\n<ul>\n<li>1. An intro email/cover letter telling us why you are the right developer for FlexJobs - don't forget to tell us about your remote work experience</li>\n<li>2. A current resume in .doc, .docx, .pdf, markdown, or .txt</li>\n<li>3. Applications can be sent through FlexJobs or by email to <a href=\"mailto:jobs@flexjobs.com\">jobs@flexjobs.com</a>\n</li>\n</ul>",
    "company": "FlexJobs",
    "company_url": "http://www.flexjobs.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/11e40dc0-0ab1-11e8-8e43-9f2a564d2a96.png",
    "url": "http://jobs.github.com/positions/ea4525b0-0ab0-11e8-9519-95ecaf4f4223"
  },
  {
    "id": "e1ecf82c-0aa9-11e8-965b-ab28c74d9bd4",
    "created_at": "Mon Feb 05 19:23:18 UTC 2018",
    "title": "Web Designer/Developer",
    "location": "Tampa, FL",
    "type": "Full Time",
    "description": "<p>General Summary\nIf you’re looking to take the next step in your career as a web designer and developer, have the experience and skill-set listed below, and are driven by a passion to do great work, help contribute to the goals of an organization, and embrace the use of technology, development, and design as a strategic advantage, we want to hear from you.</p>\n\n<p>The Web Designer/Developer designs, develops, deploys, and maintains the organizations website to create an interactive and amazing user experience for our target audience. The sky is the limit on the opportunities this position will have to exercise your existing knowledge and skill set and continue to expand and grow your skills as we expand our digital strategy. This position manages the day-to-day activities related to the website and is involved with the short- and long-term content goals of the organization.  The ideal candidate will have a strong understanding of industry trends, open-source CMS knowledge, effective communication skills with both internal and external stakeholders, be confident and self-motivated, provide solutions to assist in advancing the organizations goals of the website, willing to learn and stay abreast of technology and best practices, and be adaptable to changing priorities and initiatives.  This position will interact with multiple departments throughout the company to create an engaging user experience on the web that speaks to visitors world-wide.  If you're wanting to be the lone, genius web designer/developer wanting to sit in a dark room, do your own thing, crunch code, take orders and not be bothered by internal clients, this position is not the right fit.</p>\n\n<p>Principal Duties and Responsibilities:</p>\n\n<ul>\n<li>Act as key point of contact for day-to-day operation of the company website utilizing Drupal \nCMS</li>\n<li>Develop, implement, and maintain Drupal core modules, views, panels, block, custom modules, etc. to customize site behavior to achieve desired results</li>\n<li>Utilize developer skills to troubleshoot any issues that may arise and provide innovative solutions to problems that cannot be solved out of the box</li>\n<li>Provide thorough testing and quality assurance to all work rendered including testing web pages for appearance, functionality, and responsiveness in multiple browsers</li>\n<li>Cleary work and communicate with third party vendor to troubleshoot functionality issues and future development projects within CMS </li>\n<li>Develop and make ongoing recommendations to improve the site, whether it be with navigation, content, enhancement, functionality, or other means so the site is visually appealing, easy to read, and navigate</li>\n<li>Test site for usability on an on-going basis (i.e. form submissions correctly going through lead admin, assets download properly, page URLs not broken, etc.)</li>\n<li>Review and ensure all content changes made to the website by you and the content mangers follows brand standards and best practices</li>\n<li>Work with stakeholders and content owners within the organization to understand business requirements to keep content and imagery on the website fresh and relevant for the best user experience</li>\n<li>Assist in developing and documenting content management system standards, guidelines, and processes for online content which are consistent with our brand guidelines</li>\n<li>Apply critical thinking skills to 'interpret' content and present it in a way that makes sense to users</li>\n<li>Assist in developing content strategy aligned with short-term and long-term marketing goals</li>\n<li>Advise content owners to determine which/how much content is appropriate and best format for content (e.g., HTML page, plain PDF or page-turner PDF) in terms of user experience, findability, SEO, etc.</li>\n<li>Ensure best practices are adhered to within the content, including but not limited to internal links, optimized headings, proper formatting and tagging of photography and graphics, etc.</li>\n<li>Develop customized landing pages to be used in paid advertising efforts </li>\n<li>Develop original website design ideas, within the predetermined template, that bring simplicity and user friendliness to complex roadblocks</li>\n<li>Prepare wireframes, storyboards, user flows, process flows and site maps as needed</li>\n<li>Maintain a consistent look and feel throughout website</li>\n<li>Stay abreast of trends in web design, coding, functionality, etc. to ensure we are adhering to web best practices and implementing technology as needed</li>\n</ul><p>Requirements &amp; Qualifications:</p>\n\n<ul>\n<li>3+ years of core experience with configuration, administration, design, development, and management of a website, using Drupal, or similar open source CMS and LAMP (Linux, Apache, MySQL, PHP) stack </li>\n<li>Expert knowledge of HTML5, CSS3, Javascript (jQuery), ANGULAR JS1.x, PHP, MySQL db integration, SQL database infrastructure, and Git</li>\n<li>Advanced knowledge of SASS/SCSS</li>\n<li>Intermediate experience with implementing Drupal core modules, views, panels, blocks, etc. and developing custom Drupal modules </li>\n<li>Strong full stack development knowledge</li>\n<li>Expert user interface design skills </li>\n<li>Ability to create compelling and innovative web pages and landing pages while working within the constraints of a template system</li>\n<li>Advanced knowledge of best practices for web design and web usability</li>\n<li>Ability to work well independently and collaboratively in a team environment </li>\n<li>Exceptional stakeholder management</li>\n<li>Strong organizational and time management skills including the ability to plan, prioritize workloads, balance multiple concurrent projects and work well under the pressure of tight deadlines and changing demands</li>\n<li>Must be extremely detail oriented with a high degree of accuracy</li>\n<li>Familiarity with design tools such as Photoshop, Illustrator, etc.</li>\n<li>Understanding of digital marketing including basic SEO and PPC</li>\n<li>Ability to review headlines and overall content for style consistency</li>\n<li>BA/BS with specialization in web design and development preferred or relevant work experience</li>\n<li>Portfolio of verifiable work on website of similar scope and complexity </li>\n<li>Experience with international sites, a plus</li>\n<li>Familiarity with email marketing software, a plus</li>\n<li>Knowledge of Google Analytics and data driven design, a plus\nAdditional Skills for Success:</li>\n<li>Strong communication skills</li>\n<li>A positive attitude</li>\n<li>Enthusiastic and willing to learn</li>\n<li>Confident and self-motivated with a strong work ethic</li>\n<li>A people person who is excellent at working with other people, teams, and building relationships</li>\n<li>A problem solver – keen to understand customer needs and offer solutions</li>\n</ul>",
    "how_to_apply": "<p>Email resume and salary requirements to: <a href=\"mailto:wperez@ispe.org\">wperez@ispe.org</a></p>",
    "company": "ISPE",
    "company_url": "http://ISPE",
    "company_logo": "http://github-jobs.s3.amazonaws.com/d89661e6-0aa9-11e8-9dd5-2eba2c4360ef.jpg",
    "url": "http://jobs.github.com/positions/e1ecf82c-0aa9-11e8-965b-ab28c74d9bd4"
  },
  {
    "id": "b4de5f62-0520-11e8-8853-f946cd8a523c",
    "created_at": "Mon Jan 29 18:24:41 UTC 2018",
    "title": "Web Application Developer",
    "location": "Chesapeake, VA, other",
    "type": "Full Time",
    "description": "<p>Emprise Corporation, with offices located in Ledyard, CT and Chesapeake, VA, provides condition monitoring services, software development, and software support for clients worldwide. Major customers include the U.S. Military Sealift Command, Covanta Energy, American Styrenics, Crowley Marine, Keystone Shipping Great Lakes Fleet, and Groton Utilities.  Our present initiatives include Database configuration software development.  Network reconfiguration to support centralized data storage and mining.  Oil analysis software modernization.  Personal digital vibration analyzer.  Thermography equipment modernization and Vibration analysis software modernization.</p>\n\n<p>Emprise is a growing company with employment opportunities in both locations. Our Employees enjoy a casual work environment, excellent pay and benefits.  Please see our website <a href=\"http://www.emprisecorporation.com\">www.emprisecorporation.com</a> for more information or Email your resume and links to your portfolio, GitHub, or other public profiles to <a href=\"mailto:jobs@emprisecorporation.com\">jobs@emprisecorporation.com</a>  </p>\n\n<p>Required:</p>\n\n<ul>\n<li>  Bachelor’s degree in Computer Science or equivalent years’ experience in Applications environment</li>\n<li>  Expert-level knowledge and experience of JavaScript.</li>\n<li>  Intermediate to expert-level knowledge and experience with HTML, CSS.</li>\n<li>  Familiarity with AngularJS, Git/GitHub, npm or Yarn, SCSS.</li>\n<li>  Comfortable with text-based communication like IM, chat, and email.</li>\n<li>  Experience supporting IE10+, Firefox, and Chrome.</li>\n<li>  Expertise with Java and/or C#</li>\n</ul><p>Desired:</p>\n\n<ul>\n<li>  Experience with Java, Spring, JDBC, Apache Tomcat or similar languages/tools.</li>\n<li>  Experience with Eclipse, or maven/gradle.</li>\n<li>  Experience with Lodash.</li>\n<li>  Familiarity with a development pipeline, like Webpack/rollup/TypeScript, gulp, etc.</li>\n<li>  Familiarity with automated testing Mocha, Karma, TestNG.</li>\n<li>  Familiarity with alternative libraries like React, VueJS, Angular (v2+), etc.</li>\n<li>  Familiarity with an Agile workflow.</li>\n<li>  Familiarity with continuous integration tools.</li>\n</ul><p>Position Objectives:   Turning feature requests into reality. Researching and resolving issues. Working to improve the quality of the application and the team. Much of the work is done on an AngularJS (v1.x) web application, and will be in JavaScript (ES6/2015+), HTML, CSS/SCSS, with light Java.</p>",
    "how_to_apply": "<p>Email your resume and links to your portfolio, GitHub, or other public profiles to <a href=\"mailto:jobs@emprisecorporation.com\">jobs@emprisecorporation.com</a></p>",
    "company": "Emprise Corporation",
    "company_url": "http://www.emprisecorporation.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/a7f613ee-0520-11e8-8f23-86587a1efb13.png",
    "url": "http://jobs.github.com/positions/b4de5f62-0520-11e8-8853-f946cd8a523c"
  },
  {
    "id": "17e23ac8-01ef-11e8-8dae-3c6ffa1df26e",
    "created_at": "Thu Jan 25 16:45:04 UTC 2018",
    "title": "Sr. Java Software Engineer - Apple Customer Systems",
    "location": "Cupertino, CA",
    "type": "Full Time",
    "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>Do you love designing &amp; architecting highly scalable applications? Does the idea of performance tuning Java applications make your heart leap? Would you like to work in a fast-paced environment where your technical abilities will be challenged on a day to day basis? Would you enjoy exploring new technologies?</p>\n\n<p>Apple Customer Systems Team is looking for a highly motivated, detail-oriented, energetic individual with excellent communication skills who is not afraid to think outside the box and question assumptions. In this role, you will be part of a fast growing, cohesive team with many exciting responsibilities related to n-tier application development.</p>\n\n<p>Key Qualifications:  </p>\n\n<ul>\n<li>Hands-on expertise in Java and Java enterprise technology applications architecture, design, development and support</li>\n<li>Strong knowledge of concurrency, scalability and fault tolerant designs</li>\n<li>NoSQL database experience, particularly with MongoDB</li>\n<li>Able to analyze business requirements and create efficient solutions</li>\n<li>Must be able to brainstorm and communicate technology ideas and issues with peers and IT management</li>\n<li>Excellent problem solving, critical thinking and communication skills</li>\n<li>Must be able to clearly define solutions for requirements and evaluate options</li>\n<li>Solid knowledge of applications performance improvement techniques and caching solutions</li>\n<li>Agile development experience is a plus</li>\n<li>Core skill: Java/J2EE</li>\n</ul><p>Description:\nLead design, development, implementation and maintenance of java applications &amp; back-end services demonstrating service-oriented architecture and secure applications development technology best practices\nWork with project managers and technical teams in a cross-functional environment, to implement quality products that meet business goals\nKeep up-to date on latest Java/J2EE solutions to generate innovative ideas to solve business challenges</p>\n\n<p>Education:\nBA/BS in Computer Science or related field with 7+ years of overall experience</p>\n\n<p>Additional Requirements:\nStrong Plus: Experience with Angular 2, ReactJS or VueJS\nStrong Plus: Experience with Java backend MVC frameworks such as Spring\nStrong Plus: Spark, Kafka, Hadoop etc.,\nScripting Languages: Python</p>\n\n<p>Apple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.</p>\n\n<p>REQUISITION NUMBER: 113408843\nCOMPANY NAME: Apple Inc.</p>",
    "how_to_apply": "<p><a href=\"https://ars2.equest.com/?response_id=8cbfae954ccd4df40afb746180a94fb2\">APPLY HERE</a></p>",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/a2e371d8-01ee-11e8-9847-16a4c947afc6.jpeg",
    "url": "http://jobs.github.com/positions/17e23ac8-01ef-11e8-8dae-3c6ffa1df26e"
  },
  {
    "id": "58df5800-0080-11e8-943a-56c675716f17",
    "created_at": "Tue Jan 23 21:00:44 UTC 2018",
    "title": "Sr. Software Engineer",
    "location": "San Ramon, CA",
    "type": "Full Time",
    "description": "<p>Sr. Software Engineer</p>\n\n<p>We are looking for a talented and entrepreneurially minded Sr. Software Engineer to join our high performing team and work with the latest technologies! You will be engaged throughout the full life cycle of the product including architecting, developing, documenting, troubleshooting, supporting, bug fixing, and more. </p>\n\n<p>The ideal candidate will have experience developing a product in a microservice architecture using Node.js and TypeScript on the server side. This API will be accessed from an Angular client, smart phone apps, and various other systems. Our engineers can work on any or all of these pieces as needed which is a constant opportunity for learning. </p>\n\n<p>We need software engineers that: </p>\n\n<ul>\n<li>Have hands on experience working with large web applications </li>\n<li>Know the value of modularity and keeping it simple </li>\n<li>Use object oriented programming practices </li>\n<li>Feel comfortable with relational databases </li>\n<li>Love working as part of a strong team </li>\n<li>Want to keep up on the latest technologies and drive innovation </li>\n<li>Enjoy working in an interactive, agile environment </li>\n</ul><p>Useful Experience: </p>\n\n<ul>\n<li>Microservice Architecture </li>\n<li>Node.js </li>\n<li>Angular </li>\n<li>Docker </li>\n<li>AWS </li>\n<li>SCRUM </li>\n<li>Typescript, C#, Java </li>\n<li>SQL </li>\n<li>ORM </li>\n</ul><p>Typically we find it takes a college degree plus 5 or more years of experience to get all this dialed in but, if you feel like you have what we need, don’t let that hold you back. </p>\n\n<p>We are unable to provide or transfer sponsorship at this time.</p>",
    "how_to_apply": "<p>To apply please email your resume, GitHub or website to <a href=\"mailto:jkuemmel@pscu.com\">jkuemmel@pscu.com</a> with the subject “Sr. Software Engineer”.</p>",
    "company": "PSCU",
    "company_url": "http://www.pscu.com",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/58df5800-0080-11e8-943a-56c675716f17"
  },
  {
    "id": "ceeff638-0078-11e8-85d1-92da8522ea65",
    "created_at": "Tue Jan 23 20:07:04 UTC 2018",
    "title": "Node.js Developer",
    "location": "Boca Raton, FL",
    "type": "Full Time",
    "description": "<p>Node.js Developer # 1116</p>\n\n<p>Position Summary:</p>\n\n<p>We are seeking a creative and talented engineer to provide technical expertise in software design and development. The successful candidate will have a proven track record for creating efficient, scalable, and manageable enterprise-level systems using open source technologies (Node.js, MySQL, MongoDB, Linux) hosted on AWS. You will be expected to be self-driven, think outside the box, and open to working in a fast paced startup environment with tight deadlines.</p>\n\n<p>Experience and Education:</p>\n\n<p>Bachelor’s degree in Computer Science or equivalent experience\n4+ years experience building large-scale server applications using a micro service based architecture\n4+ years experience working on high volume websites\nA deep, abiding love for building scalable, high performance systems</p>\n\n<p>Technology Skills and Strengths:</p>\n\n<p>Strong proficiency with Node.js\nHTML5, CSS3\nWeb Services (SOAP and/or REST)\nCloud Development(AWS or similar)\nMongo DB, MySql DB\nDocker\nMicroservices\nContinuous Integration tools\nAgile methodologies\nProficient understanding of code versioning tools such as Git\nCreating database schemas that represent and support business processes\nExpert-level understanding of the systems development life cycle\nExperience with caching high traffic sites and microservices\nAngular JS a plus\nHighly adept at innovating and thinking beyond established standards and processes\nDemonstrated organizational, analytical and interpersonal skills\nFlexible team player\nAbility to manage tasks independently without close supervision and take ownership of responsibilities\nExpert-level ability to communicate highly complex technical information clearly and articulately at all levels and audiences\nAbility to adapt to a rapidly changing environment\nComfortable with a fast paced start up environment and tight deadlines</p>\n\n<p>Primary Job Responsibilities:</p>\n\n<p>Build out features across the entire development stack\nDrive new features as well as maintain existing code\nUnderstand the business well enough to align your development with company goals\nCreate and share dev best practices and standards. Always be learning\nCollaborate on the design of new build outs and write tests to maximize efficiency\nPerform code reviews to ensure best practices are being employed</p>",
    "how_to_apply": "<p>please send your resume to <a href=\"mailto:RecruitingCoordinator@rangertech.com\">RecruitingCoordinator@rangertech.com</a> and reference this GitHub Node.JS role!</p>",
    "company": "Ranger Technical Resources",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/03f42df6-0077-11e8-984b-4b784e0216bf.png",
    "url": "http://jobs.github.com/positions/ceeff638-0078-11e8-85d1-92da8522ea65"
  },
  {
    "id": "b20dc1da-ff79-11e7-876e-aeca2bee170c",
    "created_at": "Mon Jan 22 13:41:50 UTC 2018",
    "title": "Hybris Developer",
    "location": "Eindhoven",
    "type": "Full Time",
    "description": "<p><strong>With its solidly-grounded commerce skills and technical knowledge, Elision is a trusted advisor for building high-end commerce trade channels.</strong><br><br>\nElision delivers solutions that guarantee a consistent interaction over all channels and touchpoints. We create value by means of a comprehensive package of services, from digital strategy consulting and service design to development and managed services. This makes Elision the partner for companies accompanying them in their digital transformation.<br><br>\nElision is an innovative player and offers the best possible solution within the SAP Customer Engagement and Commerce landscape: hybris commerce, hybris marketing and C4C.<br><br>\nElision is part of the Xplore group (Cronos).<br><br>\nAs our growth continues, we are looking for experienced Hybris developers to join our teams for projects in the Netherlands!<br><br><strong>YOUR POSITION</strong><br>\nWorking in a team on the development of high-end e-commerce applications for global brands, B2B contexts and general Omni-channel digitalisation projects. You are a technical expert in SAP Hybris and closely follow developments in the field of Java development, focussing on back-end or front-end (or both).<br><br><strong>WHO ARE YOU?</strong><br>\nYou have 5 years off relevant consulting or industry experience and at least 3+ years' experience in implementing the Hybris platform (5.x and 6.x). A Strong background in Java/Spring environments and hands-on development experience, as well as a good knowledge of object-oriented principles, design patterns, database design and data modelling is required. You're familiar with front-end ( HTML, CSS, Bootstrap, Angular, React , ... ) and back-end Java-based frameworks.<br><br><em>\"Great things in business are never done by one person, they are done by a team of people.\" Steve Jobs</em><br></p>\n\n<ul>\n<li>You are a real team player</li>\n<li>You have experience in agile development</li>\n<li>In all of this you are customer oriented and you strive to get the job done</li>\n<li>Communication is essential as you are working together with clients and a team of developers, architects, analysts, project managers and other</li>\n<li>You preferably obtained a bachelor or a master's degree</li>\n<li>Besides Dutch you also possess a good knowledge of English</li>\n</ul><p><strong>WE OFFER YOU</strong></p>\n\n<ul>\n<li>A permanent position in a young team, with room for creativity, initiative and growth</li>\n<li>A pleasant working environment in a traffic jam-free location</li>\n<li>An opportunity for growth and learn from the experts in the business</li>\n<li>Trainings and events on a regular base</li>\n</ul><p><strong>INTERESTED?</strong><br>\nPlease apply using the <strong>link</strong> on the right side.<br><br><em>Keywords: Vacancy, full-time, Eindhoven, development, front-end, Hybris.</em></p>",
    "how_to_apply": "<p><a href=\"https://elision.redirect.your-jobresponse.com/hybris_developer_eindhoven/187213/V819/apply\">Click here to apply online!</a></p>",
    "company": "Elision",
    "company_url": "https://elision.redirect.your-jobresponse.com/h/187213/V819/apply",
    "company_logo": "http://github-jobs.s3.amazonaws.com/9b30fdce-ff79-11e7-92fb-6f454c0e16d6.png",
    "url": "http://jobs.github.com/positions/b20dc1da-ff79-11e7-876e-aeca2bee170c"
  },
  {
    "id": "3afa0270-fd6c-11e7-8225-a795ad2d2efb",
    "created_at": "Fri Jan 19 22:59:50 UTC 2018",
    "title": "Full Stack Platform Developer",
    "location": "San Francisco",
    "type": "Full Time",
    "description": "<p><b>Who we are:</b></p>\n\n<p>Panoply is set out to revolutionize the world of advanced data management, making it easy and fun to digest hundreds of different data sources, in real-time and petabyte-scale. The developers at Panoply are working on building a cutting-edge platform that can absorb massive amounts of data, in minutes, and provide users with an engaging experience for loading, transforming and exploring their data. </p>\n\n<p><b>You will:</b></p>\n\n<ul>\n<li>Lead the design and architecture of the data processing pipeline and the core query engine, as \n   well as build developer tools &amp; APIs.</li>\n<li>Collaborate with a team of developers and customers to prototype, design, and build creative \n   user-facing products.</li>\n<li>Build integration code with many cutting-edge technologies and processes, including Python 3, \n   Go, Presto, AWS, ML, NLP.</li>\n</ul><p><b>You'll need:</b></p>\n\n<ul>\n<li>Passion about technology • Drive to be the best • Awesome startup attitude</li>\n<li>3-5 years of experience in one or more of the following technologies: Go, Python, \n   Javascript/Node.js, Ruby</li>\n<li>Comprehensive expertise in Object Oriented Design, Software Architecture, Algorithms &amp; Data \n   Structures</li>\n<li>Experience or contribution to high-profile open-source projects</li>\n<li>Experience with Linux and Web-related technologies, AWS, Database Design</li>\n<li>Advantage: Experience in massive-scale data processing, using Redshift, Hadoop, Spark, EMR, \n   Google BigQuery</li>\n<li>Advantage: Experience in cutting-edge client-side technologies like HTML5, Web Components, \n   Dart, Less/Sass, D3, Angular</li>\n<li>Previous client facing experience and perfect communication skills</li>\n</ul><p><b>More about Panoply:</b></p>\n\n<p>Panoply is the world’s only ETL-less smart data warehouse. Built for the cloud, Panoply delivers the industry’s fastest time to insights by eliminating the development and coding typically associated with transforming, integrating, and managing big data. Panoply’s proprietary machine learning and natural language processing algorithms automatically enrich, transform and optimize big data, making it simple to gain actionable insights. </p>\n\n<p>Generous benefits package, free food, and unlimited coffee.</p>",
    "how_to_apply": "<p><a href=\"https://panoply.io/careers/full-stack-platform-developer/\">https://panoply.io/careers/full-stack-platform-developer/</a></p>",
    "company": "Panoply",
    "company_url": "http://panoply.io",
    "company_logo": "http://github-jobs.s3.amazonaws.com/d99b057a-fd6a-11e7-9f75-07e1b0f93271.jpg",
    "url": "http://jobs.github.com/positions/3afa0270-fd6c-11e7-8225-a795ad2d2efb"
  },
  {
    "id": "01cb1f38-fab1-11e7-8f8b-2280e19fe166",
    "created_at": "Tue Jan 16 11:34:07 UTC 2018",
    "title": "Collaboration Software Developer (Java)",
    "location": "Houten",
    "type": "Full Time",
    "description": "<p><b>Java Angular Node.JS \nWatson Bluemix Connections </b></p>\n\n<p>Als Software developer werk je aan verschillende projecten (solo en team) gerelateerd aan kunstmatige intelligentie, ongestructureerde data, en samenwerkingssoftware binnen het IBM portfolio (Connections, Watson en Bluemix). Je werkt in ons professionele clubhuis of bij een klant op locatie. In het ene project verken je technologie en/of oplossingen en in andere projecten vertaal functionele klantwensen naar een technisch ontwerp. Ook adviseer je onze klanten over de inzet van diverse IBM producten en het gebruik van open standaarden en de mogelijkheden hiervan. </p>\n\n<p>Vaak zul je werken met de standaarden Java, node.JS, Angular en/of MongoDB. Mooi is dat je bij e-office vrij bent om ook met andere technologieën te werken, mits het past in het totale plaatje van de klant of oplossing. </p>\n\n<p><b>Wie ben jij?</b><br>\nTen eerste wordt jij enthousiast van onze visie en je weet dat jij zal bloeien in een omgeving met zo veel vrijheid, verantwoordelijkheid en mogelijkheden. Je acteert op HBO/WO werk- en denkniveau en werkt graag in projecten. Je communiceert makkelijk in de Nederlandse taal, bent gedreven en ambitieus. Je vindt het een uitdaging om zelfstandig requirements uit te vragen, problemen op te lossen en oplossingen te bouwen.</p>\n\n<p>Als Software Developer heb je minimaal zo’n 2 jaar professionele ervaring met software ontwikkeling. Je hebt al gewerkt of minimaal gekeken naar de mogelijkheden van Java en/of Node.js. Mooie bijkomstigheid is als je al in aanraking bent geweest met DevOps tools zoals Jenkins en Docker. </p>\n\n<p>Uiteraard kan en mag je ook in aanraking komen met andere innovatieve technologieën binnen de IBM Connections Suite (of zelfs van de Modern Workplace van Micrososft).).</p>\n\n<p><b>Aanbod</b>\nAls je het inhoudelijk en persoonlijk beste uit jezelf wilt halen kan e-office heel erg interessant voor je zijn. Er is veel (technologische) vrijheid en je krijgt veel verantwoordelijkheid. Eigen initiatief wordt zeer gewaardeerd. </p>\n\n<p>Als Software Developer ga je aan de slag met innovatieve oplossingen voor onze klanten, deze oplossingen kunnen een cloud, artificial intelligence (A.I.), Internet of Things, en samenwerkingscomponent hebben. We betalen een goed salaris met prima secundaire arbeidsvoorwaarden, zoals bijvoorbeeld 29 vakantiedagen en een lease auto of een goede reiskostenvergoeding. Het prettige kantoor in Houten heeft allerlei voorzieningen zoals bijvoorbeeld een gezamenlijk biologische lunch.</p>\n\n<p>De balans tussen werk en privé vinden wij uitermate belangrijk en dit ondersteunen we met flexibele werktijden en de modernste samenwerkingssoftware, een laptop en een telefoon van de zaak. </p>\n\n<p><b>e-office</b><br>\nWil je als organisatie of als medewerker goed om kunnen gaan met een steeds complexere wereld, dan biedt <a href=\"http://www.e-office.com\" target=\"_blank\">e-office</a> je andere manieren van werken en samenwerken. We doen dit met name met cloud technologie van IBM(Watson, Bluemix en Connections) en Microsoft (Azure, Office365 en Dynamics365). Concreet én innovatief. Samen met <a href=\"http://www.work21.nl\" target=\"_blank\">work21</a> en <a href=\"http://www.blaud.com\" target=\"_blank\">BLAUD</a>, die ons flankeren met veranderkracht en mobiele expertise.</p>\n\n<p>e-office group is in 1991 opgericht met ‘de kracht van mensen’ als uitgangspunt. Als voorbeeld in de markt zoekt e-office altijd naar nieuwe manieren van werken, samenwerken en organiseren. Uiteraard op het snijvlak van technologie, mens en organisatie.</p>",
    "how_to_apply": "<p><a href=\"https://content.e-office.com/acton/form/18844/006f:d-0001/0/-/-/-/-/index.htm\" target=\"_blank\">Reageer hier direct</a><br><br> Uiteraard kan je ook de <a href=\"https://www.e-office.com/vacatures/software-developer/\" target=\"_blank\">vacature op onze website</a> bekijken of contact opnemen met Marcel de Jong via <a href=\"mailto:marcel.de.jong@e-office.com?SUBJECT=software%20developer%20bij%20e-office\">e-mail</a> of <a href=\"https://api.whatsapp.com/send?phone=31642740652\" target=\"_blank\"> WhatsApp</a>.</p>",
    "company": "e-office",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/e8f8af96-faad-11e7-86ea-5784eb86bcd8.png",
    "url": "http://jobs.github.com/positions/01cb1f38-fab1-11e7-8f8b-2280e19fe166"
  },{
  "id": "6f3147fa-119f-11e8-858a-f6bea5c8462d",
  "created_at": "Wed Feb 14 15:57:41 UTC 2018",
  "title": "Hybris Developer",
  "location": "Eindhoven",
  "type": "Full Time",
  "description": "<p><b>With its solidly-grounded commerce skills and technical knowledge, Elision is a trusted advisor for building high-end commerce trade channels.&lt;.b&gt;</b></p>\n\n<p>Elision delivers solutions that guarantee a consistent interaction over all channels and touchpoints. We create value by means of a comprehensive package of services, from digital strategy consulting and service design to development and managed services. This makes Elision the partner for companies accompanying them in their digital transformation.</p>\n\n<p>Elision is an innovative player and offers the best possible solution within the SAP Customer Engagement and Commerce landscape: hybris commerce, hybris marketing and C4C.</p>\n\n<p>Elision is part of the Xplore group (Cronos).</p>\n\n<p>As our growth continues, we are looking for experienced Hybris developers to join our teams for projects in the Netherlands!</p>\n\n<p><b>YOUR POSITION</b><br>\nWorking in a team on the development of high-end e-commerce applications for global brands, B2B contexts and general Omni-channel digitalisation projects. You are a technical expert in SAP Hybris and closely follow developments in the field of Java development, focussing on back-end or front-end (or both).</p>\n\n<p><b>WHO ARE YOU?</b><br>\nYou have 5 years off relevant consulting or industry experience and at least 3+ years' experience in implementing the Hybris platform (5.x and 6.x). A Strong background in Java/Spring environments and hands-on development experience, as well as a good knowledge of object-oriented principles, design patterns, database design and data modelling is required. You're familiar with front-end ( HTML, CSS, Bootstrap, Angular, React , ... ) and back-end Java-based frameworks.</p>\n\n<p><i>\"Great things in business are never done by one person, they are done by a team of people.\" Steve Jobs</i></p>\n\n<ul>\n<li>You are a real team player</li>\n<li>You have experience in agile development</li>\n<li>In all of this you are customer oriented and you strive to get the job done</li>\n<li>Communication is essential as you are working together with clients and a team of developers, architects, analysts, project managers and other</li>\n<li>You preferably obtained a bachelor or a master's degree</li>\n<li>Besides Dutch you also possess a good knowledge of English</li>\n</ul><p><b>WE OFFER YOU</b></p>\n\n<ul>\n<li>A permanent position in a young team, with room for creativity, initiative and growth</li>\n<li>A pleasant working environment in a traffic jam-free location</li>\n<li>An opportunity for growth and learn from the experts in the business</li>\n<li>Trainings and events on a regular base</li>\n</ul><p>INTERESTED?\nPlease apply using the application form.</p>\n\n<p><a href=\"https://elision.redirect.your-jobresponse.com/hybris_developer_eindhoven/187213/V819/apply\">Click here for the application form!</a></p>\n\n<p><i> Keywords: Vacancy, full-time, Eindhoven, development, front-end, Hybris.</i></p>",
  "how_to_apply": "<p><a href=\"https://elision.redirect.your-jobresponse.com/hybris_developer_eindhoven/187213/V819/apply\">Click here for the application form!</a></p>",
  "company": "Elision",
  "company_url": null,
  "company_logo": "http://github-jobs.s3.amazonaws.com/5514e0b6-119f-11e8-8821-9d5cdaeca1b1.png",
  "url": "http://jobs.github.com/positions/6f3147fa-119f-11e8-858a-f6bea5c8462d"
},
  {
    "id": "df5c2d7e-10d2-11e8-8905-81f954c87efa",
    "created_at": "Tue Feb 13 15:32:12 UTC 2018",
    "title": "Senior Frontend Developer with Angular JS 2 (Homeoffice / Flexible)",
    "location": "Remote",
    "type": "Full Time",
    "description": "<p><strong>This is a full-time remote position, we accept applications from anywhere in the world.</strong></p>\n\n<p><strong>&gt;&gt; Check out <a href=\"https://jobs.digistore24.com/senior-front-end-developer/lp/\">our job video</a> and <a href=\"https://jobs.digistore24.com/en/jobs/\">our careers page</a> to see if we would be a good fit.&lt;&lt;</strong></p>\n\n<p><em>At Digistore24 we develop software that has an impact on thousands of small and medium sized businesses every day. If you are man of action who loves to work in a small, family-like team and who has the passion and work ethic to develop great software products, we are the right fit for you.</em></p>\n\n<p>We are one of the fastest growing software companies in Europe. Our core platform is an automation solution developed by a small and extremely competent team. It provides a complete infrastructure to over 100.000 entrepreneurs to build a scalable online business with millions of customers.</p>\n\n<p><strong>The Job</strong></p>\n\n<p>We are looking for an experienced front-end developer with high motivation, a keen interest in our business use case and a sense for good user experience and beautiful design. You should be very familiar with AngularJS 2 and have an uncompromising drive to design beautiful interfaces.</p>\n\n<p>It is also important to us that you have already created a complex web application, that you have experience in agile development processes, and that you consider first-class, clean, and easily testable code as the basis of your work. You should also bring with you:</p>\n\n<ul>\n<li>Proficient understanding of web markup, including HTML5, CSS3</li>\n<li>Good understanding of advanced JavaScript libraries and frameworks, such as AngularJS 2</li>\n<li>Min. 5 years of professional experience along with a proven track record of delivering complex web projects in a leading role</li>\n<li>Basic understanding of server-side CSS pre-processing platforms, such as LESS and SASS</li>\n<li>Ability to improve architecture and code quality by refactoring</li>\n<li>Basic knowledge of image authoring tools, to be able to crop, resize, or perform small adjustments on an image. (Familiarity with tools such as as Gimp or Photoshop is a plus)</li>\n<li>Proficient understanding of cross-browser compatibility issues and ways to work around them</li>\n<li>Experience with agile development methods\n+Good English language skills with German being an asset</li>\n</ul><p><strong>The Benefits</strong></p>\n\n<p>If you bring that to the table and identify with our culture, you are welcome as a valuable member of our team. We are looking for long-term relationships and we try to get you into the project that suits you the most.</p>\n\n<p>We give so that you can contribute. If that scares you off, very well - then you do not make a bad investment and either do we. If you like our approach, then we would be really happy to hear from you.</p>\n\n<p><strong>Your Application</strong></p>\n\n<p>We do not want to assess your skills and motivation solely based on diplomas and certificates. Show us what you did. We are interested in all projects of your previous occupations, own projects, your code on Github, etc.</p>\n\n<p>Please send your application <a href=\"https://jobs.digistore24.com/senior-front-end-developer/lp/\">via our jobs page</a> and upload your resume (PDF) as well as all the work samples you think are necessary.</p>\n\n<p>When everything goes well, we will get back to you and have a short phone call. The next steps will be:</p>\n\n<ul>\n<li>a code test</li>\n<li>an interview with our CEO and the tech team</li>\n<li>a final feedback and a job offer within 2 weeks time</li>\n</ul><p>If you have questions concerning this position, don’t hesitate to send an e-mail to <a href=\"mailto:jobs@digistore24.com\">jobs@digistore24.com</a></p>",
    "how_to_apply": "<p>Please use our form: <a href=\"https://jobs.digistore24.com/senior-front-end-developer/lp/\">https://jobs.digistore24.com/senior-front-end-developer/lp/</a></p>",
    "company": "Digistore24 GmbH",
    "company_url": "http://www.jobs.digistore24.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/d69e035e-10cf-11e8-9924-19672d8bafde.jpg",
    "url": "http://jobs.github.com/positions/df5c2d7e-10d2-11e8-8905-81f954c87efa"
  },
  {
    "id": "fd005bf2-0d99-11e8-9912-b23fd801887b",
    "created_at": "Fri Feb 09 13:06:36 UTC 2018",
    "title": "Development Warlock (fulltime, Munich)",
    "location": "Munich",
    "type": "Full Time",
    "description": "<p>You like to hack/dev/program/prototype? Join us! </p>\n\n<h3>Who we are</h3>\n\n<p>mantro is a company which specializes in… ah, c'mon, let`s just cut the crap, you can take a look at the website if you are interested in that. We are a very diverse, multi-cultural and fun team with expertise from a variety of areas. What we all share is a passion for creating kick-ass products together.</p>\n\n<h3>On the backend we use</h3>\n\n<ul>\n<li>Kotlin (Spring Boot)</li>\n<li>NodeJS</li>\n<li>100% No PHP</li>\n</ul><h3>On the frontend we use</h3>\n\n<ul>\n<li>React, React, React</li>\n<li>Redux or Mobx</li>\n<li>Sometimes Ember</li>\n<li>No Angular lately...</li>\n<li>SASS, SCSS, LESS, PostCSS</li>\n<li>Webpack</li>\n<li>Typescript, or Babel</li>\n</ul><h3>On mobile we use</h3>\n\n<ul>\n<li>React Native</li>\n<li>(.. pause ..)</li>\n<li>Swift (Objective-C to feel oldschool)</li>\n<li>Java</li>\n<li>Web-Technologies / Cordova / Phonegap</li>\n</ul><h3>To store data we use</h3>\n\n<ul>\n<li>Postgres</li>\n<li>InfluxDB</li>\n<li>S3</li>\n<li>sometimes MySQL</li>\n<li>sometimes Mongo</li>\n</ul><h3>To orchestrate we use</h3>\n\n<ul>\n<li>Docker (erm, what else)</li>\n<li>Docker Compose (locally)</li>\n<li>k8s (remote)</li>\n</ul><h3>CPU power is sponsored by</h3>\n\n<ul>\n<li>AWS</li>\n<li>Digital Ocean</li>\n<li>Sometimes Heroku</li>\n</ul><h3>To work we use</h3>\n\n<ul>\n<li>(insert your IDE here)</li>\n<li>(insert your OS here)</li>\n<li>git</li>\n</ul><h3>We favor</h3>\n\n<ul>\n<li>Single page applications over server * generated html (since 2012)</li>\n<li>JSON over XML</li>\n<li>React over Ember</li>\n<li>Ember over Angular</li>\n<li>Angular over... err... ... Well, actually we don't do Angular</li>\n<li>Webpack over Gulp</li>\n<li>Pragmatic over dogmatic</li>\n<li>Solutions over problems</li>\n<li>Slack over skype</li>\n<li>Beer over wine</li>\n<li>Beef over Salad (speaking average here)</li>\n</ul><h3>We provide (one of the bullet points is a lie)</h3>\n\n<ul>\n<li>a band room</li>\n<li>a kicker table</li>\n<li>a table tennis table</li>\n<li>basketball and WiFi on the toilet</li>\n<li>lots of bureaucracy</li>\n<li>a dart board</li>\n<li>shitloads of drinks</li>\n<li>all current (and past) consoles and AR/VR shenanigans</li>\n<li>very fast internet</li>\n</ul><p>Well, if you made it until here you probably realized that we want to talk to you.</p>\n\n<p>Via Skype. Or in person. With a coffee. Or a beer.</p>\n\n<p><a href=\"mailto:hello@mantro.net\">hello@mantro.net</a></p>",
    "how_to_apply": "<p><a href=\"mailto:hello@mantro.net\">hello@mantro.net</a></p>",
    "company": "mantro GmbH",
    "company_url": "https://mantro.net",
    "company_logo": "http://github-jobs.s3.amazonaws.com/e06d45d6-0d99-11e8-87f8-a8eac4f09071.png",
    "url": "http://jobs.github.com/positions/fd005bf2-0d99-11e8-9912-b23fd801887b"
  },
  {
    "id": "67845168-5dc8-11e7-9f09-ed28a3f1978b",
    "created_at": "Wed Feb 07 20:39:48 UTC 2018",
    "title": "Full Stack Engineer @ Genius",
    "location": "Brooklyn, NY",
    "type": "Full Time",
    "description": "<p>The Genius engineering team builds and maintains a website and apps that are used by 100 million people every month. The majority of the content—lyrics, annotations, and metadata—is crowdsourced by an engaged group of contributors using a complex and ever evolving technical platform.</p>\n\n<p><a href=\"http://genius.com\"><strong>Genius</strong></a> is looking for a <a href=\"https://hire.withgoogle.com/public/jobs/geniuscom/view/P_AAAAAACAAADM2i58JVfhyW?trackingTag=gitHub\"><strong>Full Stack Engineer</strong></a> to architect and implement new features. We’re looking for makers with a sophisticated code sense: folks who’ve built cool things, but who can also maintain and scale those things, and who feel at home deep in the guts of a library.</p>\n\n<p>The best candidates will have professional experience on a web stack serving millions of users, will be proficient with Ruby on Rails, MySQL or Postgres, and have some experience with a front-end javascript framework (Angular, React, Ember, etc).</p>\n\n<h3>Responsibilities</h3>\n\n<ul>\n<li>Build and maintain web application features, primarily with Rails</li>\n<li>Work closely with application infrastructure to scale backend services to tens of thousands of requests per minute</li>\n<li>Develop the APIs that our Android and iPhone apps and web frontend consume</li>\n<li>Create frontend interfaces with HTML, CSS, and Javascript (including Angular)</li>\n<li>Write PostgreSQL queries and migrations that scale to large tables with 50M+ rows</li>\n<li>Work closely with product team to define feature specifications</li>\n<li>On-call duty to respond to urgent bugs or outages</li>\n</ul><h3>Requirements:</h3>\n\n<ul>\n<li>Significant experience writing and deploying code on a large-scale production app</li>\n<li>Significant experience with Ruby on Rails</li>\n<li>Significant experience with at least one front end framework: Angular, Ember, React, or similar</li>\n<li>Significant experience working with relational databases and writing SQL queries</li>\n</ul><h3>Ideal requirements:</h3>\n\n<ul>\n<li>3+ years experience with Rails development</li>\n<li>3+ years experience with Angular</li>\n<li>3+ years experience with PostgreSQL/MySQL</li>\n</ul><h3>Example Projects</h3>\n\n<ul>\n<li>Design an activity stream scalable to 100M+ events and a filterable “firehose” interface for consuming them</li>\n<li>HTTP-cache all pages at the edge for logged-out users only</li>\n<li>Write Javascript that can run robustly in any other website’s JS and CSS environment</li>\n<li>Develop a system for anchoring annotations to arbitrary DOM that can change out from under you</li>\n<li>Calculate document ownership based on edit history with hundreds of distinct authors</li>\n<li>Develop representation for rich text that’s portable to native iOS and Android environments</li>\n<li>Create framework for caching partial templates</li>\n<li>Design a domain-specific language and implementation of site-wide rate limits for spammy or abusive behavior</li>\n<li>Fingerprint artist names to prevent duplicate data with low false-positive rate</li>\n</ul>",
    "how_to_apply": "<h2><a href=\"https://hire.withgoogle.com/public/jobs/geniuscom/view/P_AAAAAACAAADM2i58JVfhyW?trackingTag=gitHub\">&gt;&gt; Click here to apply! &lt;&lt;</a></h2>",
    "company": "Genius",
    "company_url": "http://genius.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/49c225b0-5dc8-11e7-9020-26f5fc587e9e.png",
    "url": "http://jobs.github.com/positions/67845168-5dc8-11e7-9f09-ed28a3f1978b"
  },
  {
    "id": "73ea3f84-0a7b-11e8-96d3-71d637f7d42a",
    "created_at": "Wed Feb 07 10:06:43 UTC 2018",
    "title": "Software Engineer (full remote)",
    "location": "Full Remote Job",
    "type": "Full Time",
    "description": "<p>Du bist ausgeschlafen, hast eine schnelle Auffassungsgabe und hoffentlich eine Portion Pioniergeist. 1st Log ist Start Up Unternehmen, dass aus leidenschaftlichen Mitarbeitern und starken Produkten besteht. Kaum gegründet konnten wir schon namhafte Kunden gewinnen und sie mit unserer Innovation begeistern.</p>\n\n<p><strong>Wir stehen auf Willkommensgeschenke – das bringst Du uns mit:</strong></p>\n\n<p>Power, Leidenschaft, Pioniergeist und Feuer für neue Technologien in der Softwareentwicklung. Als Web und App Entwickler arbeitest du in Projekten mit unserem innovativen Team für Grosskunden im Logistikbereich zusammen. Du erlebst, wenn Deine selbstständig erstellten Module «zu laufen» beginnen und sich Technik und Know How zu produktiven Lösungen vereinen. Herausfordernde Aufgaben löst du kompetent, ziel- und terminorientiert und hast dabei stets Perfektion, Prozesse, Synergien und passende Technik im Auge. Du lernst mit unserem Team agil und dynamisch neue Techniken und Fachkenntnisse über Logistik.</p>\n\n<p><strong>Deine Basis</strong></p>\n\n<ul>\n<li><p>Du verfügst über Informatikkenntnisse, insbesondere ist Erfahrung mit Javascript (ES6/ES7) oder PHP ( Je nach Aufgabenbereich ) wünschenswert. Ein klarer Bonus ist Erfahrung mit Frontend Frameworks á la React / Angular / Ember.</p></li>\n<li><p>Weiterentwicklung, Wissensdurst und der Austausch mit Experten und Profis sind bei Dir Grundbedürfnisse.</p></li>\n<li><p>Du kannst aber auch einfach mal im Support und der Unterstützung unserer Kunden vor Ort mithelfen und Dich dabei gut fühlen.</p></li>\n<li><p>Du sprichst perfektes Deutsch und besitzt gute Englischkenntnisse? Dann melde Dich so schnell als möglich. Wir wollen Dich kennen lernen!</p></li>\n</ul><p><strong>Du gefällst uns – das kriegst schon mal vorweg!</strong></p>\n\n<ul>\n<li>Arbeitszeit – wie Du willst. Na ja, Abstimmung mit dem Team wäre von Vorteil </li>\n<li>Arbeitsplatz- ob Pool, Wald oder Wohnung, Du bestimmst von wo Du arbeitest </li>\n<li>Erreichbarkeit – na bei soviel Freiheit müssen wir Dich halt irgendwie erreichen </li>\n<li>Tauschmittel – ordentlich, doch je produktiver Du wirst desto mehr drücken wir ab</li>\n</ul><p><strong>Interessiert? Dann sende Deine Bewerbung an: <a href=\"mailto:jobs@1st-log.com\">jobs@1st-log.com</a></strong></p>\n\n<p>1st Log AG\nIndustriestrasse 47 \nCH-6300 Zug \n<a href=\"https://www.1st-log.com\">https://www.1st-log.com</a></p>",
    "how_to_apply": "<p><a href=\"mailto:jobs@1st-log.com\">jobs@1st-log.com</a></p>",
    "company": "1st Log AG",
    "company_url": "https://www.1st-log.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/f9d16e34-0a7a-11e8-9edf-8b545c0ce9ff.png",
    "url": "http://jobs.github.com/positions/73ea3f84-0a7b-11e8-96d3-71d637f7d42a"
  },
  {
    "id": "ea4525b0-0ab0-11e8-9519-95ecaf4f4223",
    "created_at": "Mon Feb 05 20:12:59 UTC 2018",
    "title": "Senior Ruby on Rails Developer",
    "location": "Remote/US-based",
    "type": "Full Time",
    "description": "<p>FlexJobs is hiring! Since 2007, our awesome team has been working hard to present professional, legitimate, flexible jobs to our subscribers. In the bigger picture, we aim to make the job search experience a little easier and safer through hand-screened jobs, skills testing, and a blog that explores all areas of flexible working. </p>\n\n<p>Our mission is to improve the future of work by helping people find flexible jobs that make their lives better.  We are committed to doing this internally and externally with integrity, intelligence, balance, communication, and care.</p>\n\n<p>We also walk the talk! Our entire team works remotely from locations all across the United States. The ability to flex our schedules as needed to best fit our lives allows us to work in a very focused and productive way. The teams at FlexJobs collaborate and communicate as needed -- whether that’s several times a day or a couple of times a week -- to stay connected and engaged with one another.</p>\n\n<p><strong>Skills &amp; Experience Required</strong>\nRuby on Rails, remote development, Javascript, HTML5, CSS, Bootstrap, XML, jQuery, git</p>\n\n<p><strong>You must be based in the United States</strong></p>\n\n<p>More specifically, our ideal candidates will have:</p>\n\n<ul>\n<li>5+ years Ruby on Rails development experience - we are using version 5 </li>\n<li>10+ years object-oriented, web software development</li>\n<li>Experience with client-side development technologies including  HTML5, CSS, JQuery, Javascript, AJAX, JSON</li>\n<li>Responsive web page development experience utilizing Bootstrap</li>\n<li>Experience with frameworks like Angular 5 a plus</li>\n<li>Experience with PHP and maintaining Wordpress blog sites a plus</li>\n<li>Experience building and maintaining high volume, consumer-facing websites -- bonus points if you’ve worked on subscription-based sites</li>\n<li>Experience with automated testing suites</li>\n</ul><p><strong>Traits Required</strong></p>\n\n<ul>\n<li>Be interested in a full-time, long-term position</li>\n<li>Be comfortable working independently and in small teams</li>\n<li>Have a sense of pride in your work and a passion for coding</li>\n<li>Have a streak of perfectionism when it comes to details</li>\n<li>Be highly organized, responsible, and ethical</li>\n<li>Be proactive when it comes to asking questions, brainstorming, and working with colleagues</li>\n</ul><p><strong>Other Requirements</strong></p>\n\n<ul>\n<li>You must have a reliable development environment including: high-speed Internet access, a fast computer, and phone access</li>\n<li>Your work environment must be one in which you can really focus without distractions</li>\n</ul>",
    "how_to_apply": "<p>If this sounds a lot like you, then please consider applying! What we’ll need from you:</p>\n\n<ul>\n<li>1. An intro email/cover letter telling us why you are the right developer for FlexJobs - don't forget to tell us about your remote work experience</li>\n<li>2. A current resume in .doc, .docx, .pdf, markdown, or .txt</li>\n<li>3. Applications can be sent through FlexJobs or by email to <a href=\"mailto:jobs@flexjobs.com\">jobs@flexjobs.com</a>\n</li>\n</ul>",
    "company": "FlexJobs",
    "company_url": "http://www.flexjobs.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/11e40dc0-0ab1-11e8-8e43-9f2a564d2a96.png",
    "url": "http://jobs.github.com/positions/ea4525b0-0ab0-11e8-9519-95ecaf4f4223"
  },
  {
    "id": "e1ecf82c-0aa9-11e8-965b-ab28c74d9bd4",
    "created_at": "Mon Feb 05 19:23:18 UTC 2018",
    "title": "Web Designer/Developer",
    "location": "Tampa, FL",
    "type": "Full Time",
    "description": "<p>General Summary\nIf you’re looking to take the next step in your career as a web designer and developer, have the experience and skill-set listed below, and are driven by a passion to do great work, help contribute to the goals of an organization, and embrace the use of technology, development, and design as a strategic advantage, we want to hear from you.</p>\n\n<p>The Web Designer/Developer designs, develops, deploys, and maintains the organizations website to create an interactive and amazing user experience for our target audience. The sky is the limit on the opportunities this position will have to exercise your existing knowledge and skill set and continue to expand and grow your skills as we expand our digital strategy. This position manages the day-to-day activities related to the website and is involved with the short- and long-term content goals of the organization.  The ideal candidate will have a strong understanding of industry trends, open-source CMS knowledge, effective communication skills with both internal and external stakeholders, be confident and self-motivated, provide solutions to assist in advancing the organizations goals of the website, willing to learn and stay abreast of technology and best practices, and be adaptable to changing priorities and initiatives.  This position will interact with multiple departments throughout the company to create an engaging user experience on the web that speaks to visitors world-wide.  If you're wanting to be the lone, genius web designer/developer wanting to sit in a dark room, do your own thing, crunch code, take orders and not be bothered by internal clients, this position is not the right fit.</p>\n\n<p>Principal Duties and Responsibilities:</p>\n\n<ul>\n<li>Act as key point of contact for day-to-day operation of the company website utilizing Drupal \nCMS</li>\n<li>Develop, implement, and maintain Drupal core modules, views, panels, block, custom modules, etc. to customize site behavior to achieve desired results</li>\n<li>Utilize developer skills to troubleshoot any issues that may arise and provide innovative solutions to problems that cannot be solved out of the box</li>\n<li>Provide thorough testing and quality assurance to all work rendered including testing web pages for appearance, functionality, and responsiveness in multiple browsers</li>\n<li>Cleary work and communicate with third party vendor to troubleshoot functionality issues and future development projects within CMS </li>\n<li>Develop and make ongoing recommendations to improve the site, whether it be with navigation, content, enhancement, functionality, or other means so the site is visually appealing, easy to read, and navigate</li>\n<li>Test site for usability on an on-going basis (i.e. form submissions correctly going through lead admin, assets download properly, page URLs not broken, etc.)</li>\n<li>Review and ensure all content changes made to the website by you and the content mangers follows brand standards and best practices</li>\n<li>Work with stakeholders and content owners within the organization to understand business requirements to keep content and imagery on the website fresh and relevant for the best user experience</li>\n<li>Assist in developing and documenting content management system standards, guidelines, and processes for online content which are consistent with our brand guidelines</li>\n<li>Apply critical thinking skills to 'interpret' content and present it in a way that makes sense to users</li>\n<li>Assist in developing content strategy aligned with short-term and long-term marketing goals</li>\n<li>Advise content owners to determine which/how much content is appropriate and best format for content (e.g., HTML page, plain PDF or page-turner PDF) in terms of user experience, findability, SEO, etc.</li>\n<li>Ensure best practices are adhered to within the content, including but not limited to internal links, optimized headings, proper formatting and tagging of photography and graphics, etc.</li>\n<li>Develop customized landing pages to be used in paid advertising efforts </li>\n<li>Develop original website design ideas, within the predetermined template, that bring simplicity and user friendliness to complex roadblocks</li>\n<li>Prepare wireframes, storyboards, user flows, process flows and site maps as needed</li>\n<li>Maintain a consistent look and feel throughout website</li>\n<li>Stay abreast of trends in web design, coding, functionality, etc. to ensure we are adhering to web best practices and implementing technology as needed</li>\n</ul><p>Requirements &amp; Qualifications:</p>\n\n<ul>\n<li>3+ years of core experience with configuration, administration, design, development, and management of a website, using Drupal, or similar open source CMS and LAMP (Linux, Apache, MySQL, PHP) stack </li>\n<li>Expert knowledge of HTML5, CSS3, Javascript (jQuery), ANGULAR JS1.x, PHP, MySQL db integration, SQL database infrastructure, and Git</li>\n<li>Advanced knowledge of SASS/SCSS</li>\n<li>Intermediate experience with implementing Drupal core modules, views, panels, blocks, etc. and developing custom Drupal modules </li>\n<li>Strong full stack development knowledge</li>\n<li>Expert user interface design skills </li>\n<li>Ability to create compelling and innovative web pages and landing pages while working within the constraints of a template system</li>\n<li>Advanced knowledge of best practices for web design and web usability</li>\n<li>Ability to work well independently and collaboratively in a team environment </li>\n<li>Exceptional stakeholder management</li>\n<li>Strong organizational and time management skills including the ability to plan, prioritize workloads, balance multiple concurrent projects and work well under the pressure of tight deadlines and changing demands</li>\n<li>Must be extremely detail oriented with a high degree of accuracy</li>\n<li>Familiarity with design tools such as Photoshop, Illustrator, etc.</li>\n<li>Understanding of digital marketing including basic SEO and PPC</li>\n<li>Ability to review headlines and overall content for style consistency</li>\n<li>BA/BS with specialization in web design and development preferred or relevant work experience</li>\n<li>Portfolio of verifiable work on website of similar scope and complexity </li>\n<li>Experience with international sites, a plus</li>\n<li>Familiarity with email marketing software, a plus</li>\n<li>Knowledge of Google Analytics and data driven design, a plus\nAdditional Skills for Success:</li>\n<li>Strong communication skills</li>\n<li>A positive attitude</li>\n<li>Enthusiastic and willing to learn</li>\n<li>Confident and self-motivated with a strong work ethic</li>\n<li>A people person who is excellent at working with other people, teams, and building relationships</li>\n<li>A problem solver – keen to understand customer needs and offer solutions</li>\n</ul>",
    "how_to_apply": "<p>Email resume and salary requirements to: <a href=\"mailto:wperez@ispe.org\">wperez@ispe.org</a></p>",
    "company": "ISPE",
    "company_url": "http://ISPE",
    "company_logo": "http://github-jobs.s3.amazonaws.com/d89661e6-0aa9-11e8-9dd5-2eba2c4360ef.jpg",
    "url": "http://jobs.github.com/positions/e1ecf82c-0aa9-11e8-965b-ab28c74d9bd4"
  },
  {
    "id": "b4de5f62-0520-11e8-8853-f946cd8a523c",
    "created_at": "Mon Jan 29 18:24:41 UTC 2018",
    "title": "Web Application Developer",
    "location": "Chesapeake, VA, other",
    "type": "Full Time",
    "description": "<p>Emprise Corporation, with offices located in Ledyard, CT and Chesapeake, VA, provides condition monitoring services, software development, and software support for clients worldwide. Major customers include the U.S. Military Sealift Command, Covanta Energy, American Styrenics, Crowley Marine, Keystone Shipping Great Lakes Fleet, and Groton Utilities.  Our present initiatives include Database configuration software development.  Network reconfiguration to support centralized data storage and mining.  Oil analysis software modernization.  Personal digital vibration analyzer.  Thermography equipment modernization and Vibration analysis software modernization.</p>\n\n<p>Emprise is a growing company with employment opportunities in both locations. Our Employees enjoy a casual work environment, excellent pay and benefits.  Please see our website <a href=\"http://www.emprisecorporation.com\">www.emprisecorporation.com</a> for more information or Email your resume and links to your portfolio, GitHub, or other public profiles to <a href=\"mailto:jobs@emprisecorporation.com\">jobs@emprisecorporation.com</a>  </p>\n\n<p>Required:</p>\n\n<ul>\n<li>  Bachelor’s degree in Computer Science or equivalent years’ experience in Applications environment</li>\n<li>  Expert-level knowledge and experience of JavaScript.</li>\n<li>  Intermediate to expert-level knowledge and experience with HTML, CSS.</li>\n<li>  Familiarity with AngularJS, Git/GitHub, npm or Yarn, SCSS.</li>\n<li>  Comfortable with text-based communication like IM, chat, and email.</li>\n<li>  Experience supporting IE10+, Firefox, and Chrome.</li>\n<li>  Expertise with Java and/or C#</li>\n</ul><p>Desired:</p>\n\n<ul>\n<li>  Experience with Java, Spring, JDBC, Apache Tomcat or similar languages/tools.</li>\n<li>  Experience with Eclipse, or maven/gradle.</li>\n<li>  Experience with Lodash.</li>\n<li>  Familiarity with a development pipeline, like Webpack/rollup/TypeScript, gulp, etc.</li>\n<li>  Familiarity with automated testing Mocha, Karma, TestNG.</li>\n<li>  Familiarity with alternative libraries like React, VueJS, Angular (v2+), etc.</li>\n<li>  Familiarity with an Agile workflow.</li>\n<li>  Familiarity with continuous integration tools.</li>\n</ul><p>Position Objectives:   Turning feature requests into reality. Researching and resolving issues. Working to improve the quality of the application and the team. Much of the work is done on an AngularJS (v1.x) web application, and will be in JavaScript (ES6/2015+), HTML, CSS/SCSS, with light Java.</p>",
    "how_to_apply": "<p>Email your resume and links to your portfolio, GitHub, or other public profiles to <a href=\"mailto:jobs@emprisecorporation.com\">jobs@emprisecorporation.com</a></p>",
    "company": "Emprise Corporation",
    "company_url": "http://www.emprisecorporation.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/a7f613ee-0520-11e8-8f23-86587a1efb13.png",
    "url": "http://jobs.github.com/positions/b4de5f62-0520-11e8-8853-f946cd8a523c"
  },
  {
    "id": "17e23ac8-01ef-11e8-8dae-3c6ffa1df26e",
    "created_at": "Thu Jan 25 16:45:04 UTC 2018",
    "title": "Sr. Java Software Engineer - Apple Customer Systems",
    "location": "Cupertino, CA",
    "type": "Full Time",
    "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>Do you love designing &amp; architecting highly scalable applications? Does the idea of performance tuning Java applications make your heart leap? Would you like to work in a fast-paced environment where your technical abilities will be challenged on a day to day basis? Would you enjoy exploring new technologies?</p>\n\n<p>Apple Customer Systems Team is looking for a highly motivated, detail-oriented, energetic individual with excellent communication skills who is not afraid to think outside the box and question assumptions. In this role, you will be part of a fast growing, cohesive team with many exciting responsibilities related to n-tier application development.</p>\n\n<p>Key Qualifications:  </p>\n\n<ul>\n<li>Hands-on expertise in Java and Java enterprise technology applications architecture, design, development and support</li>\n<li>Strong knowledge of concurrency, scalability and fault tolerant designs</li>\n<li>NoSQL database experience, particularly with MongoDB</li>\n<li>Able to analyze business requirements and create efficient solutions</li>\n<li>Must be able to brainstorm and communicate technology ideas and issues with peers and IT management</li>\n<li>Excellent problem solving, critical thinking and communication skills</li>\n<li>Must be able to clearly define solutions for requirements and evaluate options</li>\n<li>Solid knowledge of applications performance improvement techniques and caching solutions</li>\n<li>Agile development experience is a plus</li>\n<li>Core skill: Java/J2EE</li>\n</ul><p>Description:\nLead design, development, implementation and maintenance of java applications &amp; back-end services demonstrating service-oriented architecture and secure applications development technology best practices\nWork with project managers and technical teams in a cross-functional environment, to implement quality products that meet business goals\nKeep up-to date on latest Java/J2EE solutions to generate innovative ideas to solve business challenges</p>\n\n<p>Education:\nBA/BS in Computer Science or related field with 7+ years of overall experience</p>\n\n<p>Additional Requirements:\nStrong Plus: Experience with Angular 2, ReactJS or VueJS\nStrong Plus: Experience with Java backend MVC frameworks such as Spring\nStrong Plus: Spark, Kafka, Hadoop etc.,\nScripting Languages: Python</p>\n\n<p>Apple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.</p>\n\n<p>REQUISITION NUMBER: 113408843\nCOMPANY NAME: Apple Inc.</p>",
    "how_to_apply": "<p><a href=\"https://ars2.equest.com/?response_id=8cbfae954ccd4df40afb746180a94fb2\">APPLY HERE</a></p>",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/a2e371d8-01ee-11e8-9847-16a4c947afc6.jpeg",
    "url": "http://jobs.github.com/positions/17e23ac8-01ef-11e8-8dae-3c6ffa1df26e"
  },
  {
    "id": "58df5800-0080-11e8-943a-56c675716f17",
    "created_at": "Tue Jan 23 21:00:44 UTC 2018",
    "title": "Sr. Software Engineer",
    "location": "San Ramon, CA",
    "type": "Full Time",
    "description": "<p>Sr. Software Engineer</p>\n\n<p>We are looking for a talented and entrepreneurially minded Sr. Software Engineer to join our high performing team and work with the latest technologies! You will be engaged throughout the full life cycle of the product including architecting, developing, documenting, troubleshooting, supporting, bug fixing, and more. </p>\n\n<p>The ideal candidate will have experience developing a product in a microservice architecture using Node.js and TypeScript on the server side. This API will be accessed from an Angular client, smart phone apps, and various other systems. Our engineers can work on any or all of these pieces as needed which is a constant opportunity for learning. </p>\n\n<p>We need software engineers that: </p>\n\n<ul>\n<li>Have hands on experience working with large web applications </li>\n<li>Know the value of modularity and keeping it simple </li>\n<li>Use object oriented programming practices </li>\n<li>Feel comfortable with relational databases </li>\n<li>Love working as part of a strong team </li>\n<li>Want to keep up on the latest technologies and drive innovation </li>\n<li>Enjoy working in an interactive, agile environment </li>\n</ul><p>Useful Experience: </p>\n\n<ul>\n<li>Microservice Architecture </li>\n<li>Node.js </li>\n<li>Angular </li>\n<li>Docker </li>\n<li>AWS </li>\n<li>SCRUM </li>\n<li>Typescript, C#, Java </li>\n<li>SQL </li>\n<li>ORM </li>\n</ul><p>Typically we find it takes a college degree plus 5 or more years of experience to get all this dialed in but, if you feel like you have what we need, don’t let that hold you back. </p>\n\n<p>We are unable to provide or transfer sponsorship at this time.</p>",
    "how_to_apply": "<p>To apply please email your resume, GitHub or website to <a href=\"mailto:jkuemmel@pscu.com\">jkuemmel@pscu.com</a> with the subject “Sr. Software Engineer”.</p>",
    "company": "PSCU",
    "company_url": "http://www.pscu.com",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/58df5800-0080-11e8-943a-56c675716f17"
  },
  {
    "id": "ceeff638-0078-11e8-85d1-92da8522ea65",
    "created_at": "Tue Jan 23 20:07:04 UTC 2018",
    "title": "Node.js Developer",
    "location": "Boca Raton, FL",
    "type": "Full Time",
    "description": "<p>Node.js Developer # 1116</p>\n\n<p>Position Summary:</p>\n\n<p>We are seeking a creative and talented engineer to provide technical expertise in software design and development. The successful candidate will have a proven track record for creating efficient, scalable, and manageable enterprise-level systems using open source technologies (Node.js, MySQL, MongoDB, Linux) hosted on AWS. You will be expected to be self-driven, think outside the box, and open to working in a fast paced startup environment with tight deadlines.</p>\n\n<p>Experience and Education:</p>\n\n<p>Bachelor’s degree in Computer Science or equivalent experience\n4+ years experience building large-scale server applications using a micro service based architecture\n4+ years experience working on high volume websites\nA deep, abiding love for building scalable, high performance systems</p>\n\n<p>Technology Skills and Strengths:</p>\n\n<p>Strong proficiency with Node.js\nHTML5, CSS3\nWeb Services (SOAP and/or REST)\nCloud Development(AWS or similar)\nMongo DB, MySql DB\nDocker\nMicroservices\nContinuous Integration tools\nAgile methodologies\nProficient understanding of code versioning tools such as Git\nCreating database schemas that represent and support business processes\nExpert-level understanding of the systems development life cycle\nExperience with caching high traffic sites and microservices\nAngular JS a plus\nHighly adept at innovating and thinking beyond established standards and processes\nDemonstrated organizational, analytical and interpersonal skills\nFlexible team player\nAbility to manage tasks independently without close supervision and take ownership of responsibilities\nExpert-level ability to communicate highly complex technical information clearly and articulately at all levels and audiences\nAbility to adapt to a rapidly changing environment\nComfortable with a fast paced start up environment and tight deadlines</p>\n\n<p>Primary Job Responsibilities:</p>\n\n<p>Build out features across the entire development stack\nDrive new features as well as maintain existing code\nUnderstand the business well enough to align your development with company goals\nCreate and share dev best practices and standards. Always be learning\nCollaborate on the design of new build outs and write tests to maximize efficiency\nPerform code reviews to ensure best practices are being employed</p>",
    "how_to_apply": "<p>please send your resume to <a href=\"mailto:RecruitingCoordinator@rangertech.com\">RecruitingCoordinator@rangertech.com</a> and reference this GitHub Node.JS role!</p>",
    "company": "Ranger Technical Resources",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/03f42df6-0077-11e8-984b-4b784e0216bf.png",
    "url": "http://jobs.github.com/positions/ceeff638-0078-11e8-85d1-92da8522ea65"
  },
  {
    "id": "b20dc1da-ff79-11e7-876e-aeca2bee170c",
    "created_at": "Mon Jan 22 13:41:50 UTC 2018",
    "title": "Hybris Developer",
    "location": "Eindhoven",
    "type": "Full Time",
    "description": "<p><strong>With its solidly-grounded commerce skills and technical knowledge, Elision is a trusted advisor for building high-end commerce trade channels.</strong><br><br>\nElision delivers solutions that guarantee a consistent interaction over all channels and touchpoints. We create value by means of a comprehensive package of services, from digital strategy consulting and service design to development and managed services. This makes Elision the partner for companies accompanying them in their digital transformation.<br><br>\nElision is an innovative player and offers the best possible solution within the SAP Customer Engagement and Commerce landscape: hybris commerce, hybris marketing and C4C.<br><br>\nElision is part of the Xplore group (Cronos).<br><br>\nAs our growth continues, we are looking for experienced Hybris developers to join our teams for projects in the Netherlands!<br><br><strong>YOUR POSITION</strong><br>\nWorking in a team on the development of high-end e-commerce applications for global brands, B2B contexts and general Omni-channel digitalisation projects. You are a technical expert in SAP Hybris and closely follow developments in the field of Java development, focussing on back-end or front-end (or both).<br><br><strong>WHO ARE YOU?</strong><br>\nYou have 5 years off relevant consulting or industry experience and at least 3+ years' experience in implementing the Hybris platform (5.x and 6.x). A Strong background in Java/Spring environments and hands-on development experience, as well as a good knowledge of object-oriented principles, design patterns, database design and data modelling is required. You're familiar with front-end ( HTML, CSS, Bootstrap, Angular, React , ... ) and back-end Java-based frameworks.<br><br><em>\"Great things in business are never done by one person, they are done by a team of people.\" Steve Jobs</em><br></p>\n\n<ul>\n<li>You are a real team player</li>\n<li>You have experience in agile development</li>\n<li>In all of this you are customer oriented and you strive to get the job done</li>\n<li>Communication is essential as you are working together with clients and a team of developers, architects, analysts, project managers and other</li>\n<li>You preferably obtained a bachelor or a master's degree</li>\n<li>Besides Dutch you also possess a good knowledge of English</li>\n</ul><p><strong>WE OFFER YOU</strong></p>\n\n<ul>\n<li>A permanent position in a young team, with room for creativity, initiative and growth</li>\n<li>A pleasant working environment in a traffic jam-free location</li>\n<li>An opportunity for growth and learn from the experts in the business</li>\n<li>Trainings and events on a regular base</li>\n</ul><p><strong>INTERESTED?</strong><br>\nPlease apply using the <strong>link</strong> on the right side.<br><br><em>Keywords: Vacancy, full-time, Eindhoven, development, front-end, Hybris.</em></p>",
    "how_to_apply": "<p><a href=\"https://elision.redirect.your-jobresponse.com/hybris_developer_eindhoven/187213/V819/apply\">Click here to apply online!</a></p>",
    "company": "Elision",
    "company_url": "https://elision.redirect.your-jobresponse.com/h/187213/V819/apply",
    "company_logo": "http://github-jobs.s3.amazonaws.com/9b30fdce-ff79-11e7-92fb-6f454c0e16d6.png",
    "url": "http://jobs.github.com/positions/b20dc1da-ff79-11e7-876e-aeca2bee170c"
  },
  {
    "id": "3afa0270-fd6c-11e7-8225-a795ad2d2efb",
    "created_at": "Fri Jan 19 22:59:50 UTC 2018",
    "title": "Full Stack Platform Developer",
    "location": "San Francisco",
    "type": "Full Time",
    "description": "<p><b>Who we are:</b></p>\n\n<p>Panoply is set out to revolutionize the world of advanced data management, making it easy and fun to digest hundreds of different data sources, in real-time and petabyte-scale. The developers at Panoply are working on building a cutting-edge platform that can absorb massive amounts of data, in minutes, and provide users with an engaging experience for loading, transforming and exploring their data. </p>\n\n<p><b>You will:</b></p>\n\n<ul>\n<li>Lead the design and architecture of the data processing pipeline and the core query engine, as \n   well as build developer tools &amp; APIs.</li>\n<li>Collaborate with a team of developers and customers to prototype, design, and build creative \n   user-facing products.</li>\n<li>Build integration code with many cutting-edge technologies and processes, including Python 3, \n   Go, Presto, AWS, ML, NLP.</li>\n</ul><p><b>You'll need:</b></p>\n\n<ul>\n<li>Passion about technology • Drive to be the best • Awesome startup attitude</li>\n<li>3-5 years of experience in one or more of the following technologies: Go, Python, \n   Javascript/Node.js, Ruby</li>\n<li>Comprehensive expertise in Object Oriented Design, Software Architecture, Algorithms &amp; Data \n   Structures</li>\n<li>Experience or contribution to high-profile open-source projects</li>\n<li>Experience with Linux and Web-related technologies, AWS, Database Design</li>\n<li>Advantage: Experience in massive-scale data processing, using Redshift, Hadoop, Spark, EMR, \n   Google BigQuery</li>\n<li>Advantage: Experience in cutting-edge client-side technologies like HTML5, Web Components, \n   Dart, Less/Sass, D3, Angular</li>\n<li>Previous client facing experience and perfect communication skills</li>\n</ul><p><b>More about Panoply:</b></p>\n\n<p>Panoply is the world’s only ETL-less smart data warehouse. Built for the cloud, Panoply delivers the industry’s fastest time to insights by eliminating the development and coding typically associated with transforming, integrating, and managing big data. Panoply’s proprietary machine learning and natural language processing algorithms automatically enrich, transform and optimize big data, making it simple to gain actionable insights. </p>\n\n<p>Generous benefits package, free food, and unlimited coffee.</p>",
    "how_to_apply": "<p><a href=\"https://panoply.io/careers/full-stack-platform-developer/\">https://panoply.io/careers/full-stack-platform-developer/</a></p>",
    "company": "Panoply",
    "company_url": "http://panoply.io",
    "company_logo": "http://github-jobs.s3.amazonaws.com/d99b057a-fd6a-11e7-9f75-07e1b0f93271.jpg",
    "url": "http://jobs.github.com/positions/3afa0270-fd6c-11e7-8225-a795ad2d2efb"
  },
  {
    "id": "01cb1f38-fab1-11e7-8f8b-2280e19fe166",
    "created_at": "Tue Jan 16 11:34:07 UTC 2018",
    "title": "Collaboration Software Developer (Java)",
    "location": "Houten",
    "type": "Full Time",
    "description": "<p><b>Java Angular Node.JS \nWatson Bluemix Connections </b></p>\n\n<p>Als Software developer werk je aan verschillende projecten (solo en team) gerelateerd aan kunstmatige intelligentie, ongestructureerde data, en samenwerkingssoftware binnen het IBM portfolio (Connections, Watson en Bluemix). Je werkt in ons professionele clubhuis of bij een klant op locatie. In het ene project verken je technologie en/of oplossingen en in andere projecten vertaal functionele klantwensen naar een technisch ontwerp. Ook adviseer je onze klanten over de inzet van diverse IBM producten en het gebruik van open standaarden en de mogelijkheden hiervan. </p>\n\n<p>Vaak zul je werken met de standaarden Java, node.JS, Angular en/of MongoDB. Mooi is dat je bij e-office vrij bent om ook met andere technologieën te werken, mits het past in het totale plaatje van de klant of oplossing. </p>\n\n<p><b>Wie ben jij?</b><br>\nTen eerste wordt jij enthousiast van onze visie en je weet dat jij zal bloeien in een omgeving met zo veel vrijheid, verantwoordelijkheid en mogelijkheden. Je acteert op HBO/WO werk- en denkniveau en werkt graag in projecten. Je communiceert makkelijk in de Nederlandse taal, bent gedreven en ambitieus. Je vindt het een uitdaging om zelfstandig requirements uit te vragen, problemen op te lossen en oplossingen te bouwen.</p>\n\n<p>Als Software Developer heb je minimaal zo’n 2 jaar professionele ervaring met software ontwikkeling. Je hebt al gewerkt of minimaal gekeken naar de mogelijkheden van Java en/of Node.js. Mooie bijkomstigheid is als je al in aanraking bent geweest met DevOps tools zoals Jenkins en Docker. </p>\n\n<p>Uiteraard kan en mag je ook in aanraking komen met andere innovatieve technologieën binnen de IBM Connections Suite (of zelfs van de Modern Workplace van Micrososft).).</p>\n\n<p><b>Aanbod</b>\nAls je het inhoudelijk en persoonlijk beste uit jezelf wilt halen kan e-office heel erg interessant voor je zijn. Er is veel (technologische) vrijheid en je krijgt veel verantwoordelijkheid. Eigen initiatief wordt zeer gewaardeerd. </p>\n\n<p>Als Software Developer ga je aan de slag met innovatieve oplossingen voor onze klanten, deze oplossingen kunnen een cloud, artificial intelligence (A.I.), Internet of Things, en samenwerkingscomponent hebben. We betalen een goed salaris met prima secundaire arbeidsvoorwaarden, zoals bijvoorbeeld 29 vakantiedagen en een lease auto of een goede reiskostenvergoeding. Het prettige kantoor in Houten heeft allerlei voorzieningen zoals bijvoorbeeld een gezamenlijk biologische lunch.</p>\n\n<p>De balans tussen werk en privé vinden wij uitermate belangrijk en dit ondersteunen we met flexibele werktijden en de modernste samenwerkingssoftware, een laptop en een telefoon van de zaak. </p>\n\n<p><b>e-office</b><br>\nWil je als organisatie of als medewerker goed om kunnen gaan met een steeds complexere wereld, dan biedt <a href=\"http://www.e-office.com\" target=\"_blank\">e-office</a> je andere manieren van werken en samenwerken. We doen dit met name met cloud technologie van IBM(Watson, Bluemix en Connections) en Microsoft (Azure, Office365 en Dynamics365). Concreet én innovatief. Samen met <a href=\"http://www.work21.nl\" target=\"_blank\">work21</a> en <a href=\"http://www.blaud.com\" target=\"_blank\">BLAUD</a>, die ons flankeren met veranderkracht en mobiele expertise.</p>\n\n<p>e-office group is in 1991 opgericht met ‘de kracht van mensen’ als uitgangspunt. Als voorbeeld in de markt zoekt e-office altijd naar nieuwe manieren van werken, samenwerken en organiseren. Uiteraard op het snijvlak van technologie, mens en organisatie.</p>",
    "how_to_apply": "<p><a href=\"https://content.e-office.com/acton/form/18844/006f:d-0001/0/-/-/-/-/index.htm\" target=\"_blank\">Reageer hier direct</a><br><br> Uiteraard kan je ook de <a href=\"https://www.e-office.com/vacatures/software-developer/\" target=\"_blank\">vacature op onze website</a> bekijken of contact opnemen met Marcel de Jong via <a href=\"mailto:marcel.de.jong@e-office.com?SUBJECT=software%20developer%20bij%20e-office\">e-mail</a> of <a href=\"https://api.whatsapp.com/send?phone=31642740652\" target=\"_blank\"> WhatsApp</a>.</p>",
    "company": "e-office",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/e8f8af96-faad-11e7-86ea-5784eb86bcd8.png",
    "url": "http://jobs.github.com/positions/01cb1f38-fab1-11e7-8f8b-2280e19fe166"
  }
]
